{
    "filename": {
        "0": "XI_Media_Presentation_AI_AR",
        "1": "Senior Design Pitch MAJ RG",
        "2": "Safeplan SD Presentation",
        "3": "Galajda,Jacob-SeniorDesignPresentation",
        "4": "SeniorDesign_SwarmingDrone",
        "5": "RealityFlowPitchF2020",
        "6": "UCF Student Project Pitch Deck Fall 2020",
        "7": "JML-project",
        "8": "2020 Fall CS SEE",
        "9": "Database presentation - Fall 2020",
        "10": "2+ Community - Pt1 and Pt2 Tommy James",
        "11": "2020 Fall CS SD PELT II",
        "12": "CodeFeelPitchF2020",
        "13": "CECS SD Project Assignment Processes",
        "14": "CS Design Project PCTE testing 8.31.2020 v2",
        "15": "2020 Fall CS SD PELT II-1",
        "16": "2020 Fall CS SD EZ-RASSOR RE-RASSOR Software",
        "17": "senior design 08-2020",
        "18": "Giroux-SDFall2020-Quotes",
        "19": "ProjectProposal",
        "20": "Giroux-SDFall2020-CemetARy",
        "21": "Computron 2.0 Pitch",
        "22": "BRIEF_Senior Design Pitch Hacking for Defense_31 Aug 2020"
    },
    "summary": {
        "0": "Who?XI Media LLCXI Media is active in development of advanced applications in Artificial Intelligence (AI), and Augmented Reality (AR).Dr. Project Management CertificateSix Sigma Certified: Internationally known certificate in Quality Management & Process ExcellenceProfessional Experience:. More than 15 years AR ProjectA gameBase of the app. Provided by us 3 AI Project        Placement of virtual objects on the mapSmart Matching of usersDetecting inappropriate contentPattern recognition on the phone’s camera 4. - Learn a lot about AI & AR- Work with the coolest technologies!- Possibility of a Job (based on Performance)- Graduating with up-to-date industry knowledge.",
        "1": "Senior Design Pitch Joe Remesz-Guerrette About Me Active Duty Army OfficerBoard Certified Nuclear PharmacistBoard. Certified Pharmacotherapist PharmD, MS, BS, BAMinimal program language experience  Extensive first hand experience with multiple facets of US and worldwide healthcareAssistant professor USUHS (2014)Currently serving in an operational unit Tracking Medication  Really medications and expendable medical items Throughout the ordering processAt user level (supply levels)Independent system that any end user can operate with minimal\/no training Today’s. tracking PaperOrder entry into DOD proprietary systemInaccurate Delays associated with improper ordering Applications. accountabilityTemperature sensitive monitoring‘Just. In Time…’ Must Haves Portable devicesAppIn-transit visibilityPoint of ordering trackingMaster trackingInterface with commercial products Nice to Have Temperature monitoringBar code capabilities Homeruns Ability to export data (seamlessly) to outside sourcesDOD sourcesPortable device printing capabilityMaster tracking notifications (alerts)Sensitive item identificationAbility to accept data from outside sourcesFacilitates inventories by weight, barcodes, user input.",
        "2": "Safeplan Teen Suicide Prevention and Safety Planning App Suicide is the second leading cause of death for youth between the ages of 10-24.Safety plans are a proven clinical intervention where suicidal youth work collaboratively with their therapist to identify:Triggers and Warning SignsCoping StrategiesNetworks of Social SupportStrategies for reducing access to lethal meansThis collaborative safety planning process is usually paper-based. The Human Problem Safety plans get lost: Current safety plans are done in person and on paper, and get lost or thrown awayFlexibility issues: They don’t allow for updating\/editing over time as the teen experiences changesLack of feedback: Not very interactive or encouragingTemporary:. : Youth focus groups helping to guide the design and implementationProgress tracking: Interactive features to encourage teens and support continuation of use, even after dischargeAccess to crisis services:. Display graphical data based on check-ins and send a PDF report with this same dataRecommendations: Words of encouragement and suggestions based on check-in dataPush Notifications: Reminders to complete check-ins and recommendations. participatory design study with at-risk youth to iterate on and improve featuresUpdate and complete interactive prototypeFinalize the design, functional, and technical requirements of the appSpring 2021Complete app development and testingSummer 2021 and BeyondConduct a field study using the app in a clinical settingCommercialize the app to make it widely available to clinicians and patients Timeline Research Team Lindsay Taliaferro, Ph.",
        "3": "Feature arrays for each instrument are concatenated together before hashingThis figure is an example segment of a classical string quartet songSegments are hashed to prevent as much bias as possible so that the mind of the composer can be. preservedThe hash codes for each segment are stored in the previous and next segments The Deep Composer Project cont.. are points in a 3D spaceA line drawn within this 3D space can be used to demonstrate a songEach composer will draw lines differently from each otherGiving a composer a completely different set of building blocks would theoretically allow the composer to play a different genre of music The Deep Composer Project cont. Extensive Multi-LSTM Deep Neural NetworkDesigned to recreate the minds of great composersForwards and Backwards HashingHashed-Segment Concatenation ModelProject written in Python 2 and 3Framework utilizes PyTorchOverview of network architecture demonstrated in the figure Proposal Must haves:. A music creation page for the user to request new musicAn engine page for the team to conveniently maintain and experiment with different  music generation networksNice to haves:Application is cross-platform and available to mobile devices.",
        "4": "Lockheed Martin Missiles and Fire Control Applied Research team asks students to develop an autonomous swarm of drones and\/or ground vehicles to search and destroy a pre-determined target in an simulated urban area. Students will demonstrate novel solutions to SWARM navigation, inter-agent communication, competency with ROS, and competency simulating environments with Gazebo (or a comparable framework). Objectives Fully Autonomous NavigationSwarm Size of 4-5 Agents (Drones and\/or Ground Vehicles)Inter-Agent CommunicationMulti-Sensor Exploitation (use visible cameras and LIDAR)Ability to find and disable a hostile robot under time\/resource constraints LRASM Launch and guide multiple Long Range Anti-Ship Missiles (LRASM)Autonomous NavigationGPS. Computer Science students will have the opportunity to explore robotic systems, Deep and Machine Learning topics, and the latest simulation technology. This project is not associated with either Lockheed Martin program, but each program demonstrates the utility for this technology in the future (LRASM, SQUAD X).",
        "5": "AR\/VR\/XRFounded Seebright in 2012, and have worked with XR technologies ever since Summary Amateur-friendly content development\/prototyping in situProvides interface via smartphone\/tablet to alter\/add\/save “limited kinds” of content and interactivityUsed to rapidly develop AR\/VR experiences without recompiling in a collaborative fashion Technologies:. C#MongoDBSQLiteWebsockets NodeJSUnity3DHololens 2\/Magic Leap\/Oculus Quest\/ViveiOS\/Android Previous Iterations (2 iterations) Created a server program that allows multiple clients to connect and share position\/orientation\/color of objects in a sceneHololens, Android and Unity Plugin. OR sufficiently prove DOTS is performant without code generationControl project state for user testing\/iterationIncluding global state variables and scenes (models + state). Support multiple users and allow them to create\/share projectsTransition to Unity Data-Oriented Tech StackEmulate 6dof controls with mobile device for testing\/iteration in Unity clientAdd simple logic & variables via visual scripting“Compile” configured logic into code (C#). Reach Module system for additional featuresCreate a Unity package that manages (templates, register, publish) interaction patterns (including necessary Unity code) and allows applying them to arbitrary models at runtime.",
        "6": "Advanced Programs & Special Programs(J. Reynolds) Vision & Approach VisionAP\/SP is an aggressive, capture focused organization \u000bthat creates new ideas and transitions profitable \u000bdevelopment projects to LOBsApproachAggressive and agile  Focus on prioritizing, targeting, developing customersCapture, mature, and transition business. Deep dive monthly on customer problems to learn, focus, and addressAlign International\/Offsets with AP\/SP projects to benefit MFCPlace longer-term bets on emerging, large opportunitiesInterface with AR to align with tech trendsHarness external IP via SBIRs, Universities and Int’l RelationshipsGrow workforce customer focus. Understand LOB and AP\/SP PortfolioWork with S&BD and AR to match emerging business opportunities with emerging technologies\/conceptsCreate, Develop, Design. build -current platform shall migrate to Linux compatibleOpen AI Wrapper: Python API and Open AI Gym Interface to allow players to communicate with the game serverGame Server Image Renderer:. Sub-Agent Hierarchy 3 levels deep Integration of Game Roadmap and UCF\u000bGoal: Continue Battle Rhythm To Enhance, Iterate and Improve Fall 2020:.",
        "7": "has bugsBugs can lead to failuresDeathInjuryMonetary lossLoss of trust\/reputationSecurity breaches Photo by Daniela Santos on Unsplash Current Approaches Coding StandardsCode ReviewsTesting Photo by Christina @ wocintechchat.com on Unsplash Limits of Testing. :Specify program with logicConvert program into logical statementProve that the program is correct From “An Axiomatic Basis \u000bfor Computer Programming” by C.A.R. HoareCACM, 12(10):576-583, Oct. 1969 JML:. Java Formal Methods JML Annotated Java public class Color {    public static final int SATURATED = 256;    \/*@. Overall: verify programs that use StringsDetails:Connect with newer SMT solver versionsZ3CVC4Experiment with String program verificationCheck that:Correct programs. verifyIncorrect programs give appropriate warnings Possible Extensions Extensions:Floating-point verification: float, doublePrograms that use the JDKBetter JDK specificationsJava AnnotationsIntegration with JMLWorking with nonnull and other 3rd party annotations. to verify programs using StringsConnect to newer SMT solversExperiment with verification of String programsModify the OpenJML tool.",
        "8": "US, Canada, Brazil, UK, Germany, France, Italy & BulgariaEvent will be in Brazil and VirtualProvide Distributed Simulation CapabilityIndustry Standard Distributed Computing Tools and ProductsSystem Infrastructure, Cloud Servers, VPNCollaboration and Knowledge Management Services 2 SEE UCF CS 2021. Port)Autonomously, With different classes of robots, With International PartnersWith NASA Mentor and Space Institute SupportProvide the AI Governance for a RE-RASSOR Robotic SwarmThat builds a protective berm to deflect or capture plume ejectaThat builds and landing pad from provided interlocking blocks. Some Languages C, C++, JAVA, PythonHLA-evolved, High Level Architecture (used in NASA space exploration) Tools and Skills on TeamGame Development desired working with Unity 5Some 3D modeling experienceBasic System Operations Experience Desired  Parse, Read and Write XML DataUS CitizenshipFor. for April 2021With NASA Subject Matter Experts and Concepts \/ ModelsBuild on NASA Concepts for a Mars BaseIntegrate with Simulation Infrastructure and Lunar Base elementsPresent Results to NASA Exploration CommunitySimulation will help inform Mars Planning and NASA StudiesIf. Industry Tools, Distributed Computing, Distributed VisualizationUse NASA tools and technologies to build a working Mars BaseInter-university international TeamworkProfessional network, credibility, visibility\u000bCreate something—a simulation system-- that will be enhanced and evolved by othersAdd sophistication, value and capability to the simulation to solve space exploration problems.",
        "9": "Current database is old, not relationalUnable to query and generate reportsNeed to enter data chronologicallyDatabase grew with project over decades but didn’t grow with available database techKey data reported in comments (older entries)Limited\/clunky remote access from field station    NEW DATABASE - in development Previous students developed a new database from scratch – Hosted in AWSGOAL:. problems Check for multiple tags at once to determine capture type Tag #1 Tag #2 Tag #3 NEW NEW. Access to database from a web browser with full capabilitiesDevelop phone browser interfaceAbility to add\/remove or rearrange fields or layout as neededProgramming language that does not require annual renewals of licenses or that limit the number of computers\/browsers allowed to access itAbility to track individual turtles through time with changes to tags (. tag loss\/new tags)Ability to generate customizable reports for agency deliverablesFeature with individual turtles to track fate of samples collected from those turtles\/time (where stored, if used, results from analyses like stable isotope, genetics, diet, etc.).. All of the above, plus…Capacity to store scanned documents and photos (or link records to a specific document stored in the cloud) *Already implemented, but can improve.",
        "10": "Measuring Place                    Collecting Public Behavior and public opinion Data:The goal for this portion of the project is to be able to measure the existing conditions of a public place against known other successful places. The outputs will specify areas to be worked on for the biggest impact to their public places.. Layer maps of test results on and off Create charts and graphs using data collectedCreating an algorithm: use the findings to rank the measured space relative to other “places”.. The goal for this portion of the project is to be able to create an interactive experience exposing residents to potential local projects. Models must be viewable vertically up to 400’ and stable enough to walk around from the outsideBonus: be able to walk insideClickable:.",
        "11": "There will be a hole in the groundThe debris will go someplace as some speedSomeplace includes kilometers away, and kilometers. upSome speed is many kilometers per secondThere is stuff on the ground to hitIt can be raining dust all over the moonThere. is stuff in space to hit, that is moving really realy fastLike driving through a rain storm, 200 MPH, no windshield, but worseMuch WorseWe need to Know what is happening and Share what is happening! There are still a few needs:Particle Collision Detection and Analysis, including particle to particle and particle to surface interactions.. How do we communicate?The Goal is to:Dramatically increase the ability to quickly and reliably analyze Lunar launch and landing impacts across the Cislunar environment..",
        "12": "My Background Researching user experience and content authoring in AR\/VR\/XRTeach intro to programming at graduate and undergraduate levels Summary Instructor-friendly programming behavior analysis and intervention toolBuilds on existing Intelligent Tutoring Research & System designIncorporates test-based assessment approaches for both self-assessment, feedback and automated grading of certain assignments. Current State Server with MongoDB\/Node architecture that handles GitHub webhooks and logs events (compiler errors, session details)Bash script that handles registering student git repositories with server\/databaseUnity plugin that monitors for errors and which sends test results to serverVS Code extension that saves and commits each change to git repository, and which updates each component (bash, vs-code extension, unity plugin)Submission for unity projects includes building project using virtual machine and running tests through existing test frameworkResults are posted to webcourses using manual rubric alignment Project Goals. Programming Assignments (git repos, updates & submissions)Student activity logsError and activity analysis (event notifications)Test casesProvide students with in-editor advice based on activities:Suggest videos from a set of videos on topics based on errors observedTrack progress over time (typing speed, error rate, etc)Built on a custom VS Code extension that communicates with server Minimum Requirements. , comments to be posted to WebCourses)Notifications to instructor and\/or student based on certain patterns of errors\/activity (or lack thereof). Customizable in web interface Home Run Connect project fully into webcourses for instructors at UCF to use in their classes, with a GUI for selecting assignments and configuring Rubrics for 1-3 of the technologies (React, Unity, Python)Automated tests to ensure reliability Questions?",
        "13": "CECS Senior Design Project Assignment Process Faculty Team Assignments (CS, IEMS & MAE). Student Self Selection (ECE).",
        "14": "Continuous IntegrationContinuous DeliveryOur focus is on testingParticularly within the CI pipelineBut also within CD pipelineSoftware bugsIntegration BugsImage Credit:. Katalon 8 Katalon Studio & Runtime Engine Used by UCF testers to support development of automated testing tools on PCTE platformRuntime Engine executed within an Ubuntu-based Docker containerSchedules tests using OS servicesCreates batch operations for control multiple executionsExecutes tests with distributed servers 9. so… What if we wrote a new runtime engine?Goal is to create a program that is a new runtime engine that leverages a lot of what Katalon has in placeUse tests developed in Katalon StudioTests are stored as Groovy scripts that call a WebDriver to perform actionsChrome used the mostGrouped as Test Suites. That gets exposure to CI\/CD pipelines and automated testing paradigmsBonus Extension Ideas. WebDriversFirefoxEdgeShow running within a headless environment (Xvfb in Linux)Integrate new runtime engine into Katalon Studio GUI 11 Closing Slide Questions?bcaulkin@ist.ucf.edumartin@ist.ucf.edu.",
        "15": "There will be a hole in the groundThe debris will go someplace as some speedSomeplace includes kilometers away, and kilometers. upSome speed is many kilometers per secondThere is stuff on the ground to hitIt can be raining dust all over the moonThere. is stuff in space to hit, that is moving really realy fastLike driving through a rain storm, 200 MPH, no windshield, but worseMuch WorseWe need to Know what is happening and Share what is happening! There are still a few needs:Particle Collision Detection and Analysis, including particle to particle and particle to surface interactions.. How do we communicate?The Goal is to:Dramatically increase the ability to quickly and reliably analyze Lunar launch and landing impacts across the Cislunar environment..",
        "16": "The GoalA common hardware and software (control and AI) system for use across ALL FSI Robotics projects and available to anyone who needs it. This Year Commodity Computing HardwareComputer and Robot parts from Amazon (both control and AI)Available to any user, Mega and Nvidia. Nano boards, stepper motor interfaceEZ-RASSOR SoftwareBuild Control software into Mega with wifiBuild AI into Nano, let it driveDrive and execute missions with Human or AI controlMake it all work TogetherIn Simulator, In Person, on Multiple RobotsCoaching other projects as needed, like FL Poly ¼ ton rover. So… Integrate UCF Developed, Open Source SoftwareAdd Software to make it all work in a Live environment (not trivial)Build a little robot to test it, then make it work againPut. Poly)Join the EZ-RASSOR team, Add your code to the mixBe a NASA SSERVI CollaboratorAnd, be thanked by every future project that does not have to code and build a robot from scratch, forever.",
        "17": "",
        "18": "QuotationsfromJohnson™sDictionaryAmyLarnerGiroux,. PhDConnieHarperUCFCenterforHumanities&DigitalResearch7 8QuotationResearchJohnson used quotes to show examples of usage of the wordsWhenthetextwouldn™tfitwithintheareanecessaryintheprinteddictionary, he would paraphrase the quoteSometimeshewouldmisidentifythequote or not use the right attribution 9TheData 101.IdentifyappropriateonlinecorporalikeGutenbergwhereworksbytheauthorwouldbeavailablelikeEarlyEnglishBooksOnline),ProjectGutenberg,LibertyFund,Archive.org,HathiTrust2.Determinewhetheryoucanprogrammaticallyquerythosetextsonlineorwhetheryou™llneedtohaveadownloadprocess3.Createanalgorithmwithsometypeoffuzzysearchortextreusetolocatepossiblematches. Scoreyourmatchesandoutputthetop5perword.4.Outputaspreadsheetthathastheinputdataplusthetitleoftheworkyoufounditin,alinktotheLibraryofCongress™slinkedopendatafortheauthor,alinktotheonlinetextinwhichthequotewasfound,thematchscore,andtheactualtextofthequoteyoufound.5.HaveaUIthatallowstheusertoselectaspreadsheet,thecorpustouseforcomparison,andanoutputdirectoryfortheresults. Requirements 11ExampleOutput 121.AsecondUIthatallowsausertostepthroughtherowsfromtheoutputspreadsheetandhaveitdisplaytheoriginaldictionaryquoteandthenthescoredquotesthatwerefoundandthenallowtheusertopickwhichofthe5isthebestmatchandflagthatsomewayintheexcelfile. StretchGoals 13Questions?AmyG@ucf.eduConnie.Harper@ucf.edu.",
        "19": "Project narrative description with a statement of motivation for the project (including at least one paragraph minimum per team member that describes their personal interest\/motivation in this project), a discussion of the goals and objectives, and a discussion of the function of the project.. Also you MUST include a separately labeled section or subsection with the title ﬁBroader Impactsﬂ that describes in a minimum of 1 paragraph, the broader implications or impact of your project on society both local and global. How might your project impact underrepresented groups (within science and technology (STEM) or society as a whole), the disabled, non-profit organizations, the environment, diversity, increased participation in STEM fields or the workforce, public engagement in STEM areas, improved national security, enhanced infrastructure, or improved education are all examples. Also you MUST include a separately labeled section or subsection with the title ﬁLegal, Ethical, and Privacy Issuesﬂ that describes in a minimum of 1 paragraph, any such issues that you dealt with as part of the design and implementation of your solution to the original problem and\/or that those using, maintaining, or expanding upon your solution may face going forward. A list of specifications and requirements for the project as a whole as agreed to by both your team members and your project sponsor..",
        "20": "CemetARyAugmentedRealityEnhancementsAmyLarnerGiroux,PhDNationalCemeteryAdministrationUCFCenterforHumanities&DigitalResearch1 2CemetARyŒCurrentiterationCross platform mobile appProvides. 2D navigation between sections of veteran cemeteriesAllows switching to 3D AR navigation once user nears the headstoneUses OCR scanning to read headstone text for searchingAllows dynamic scanning in various lighting conditions and anglesHasapreliminaryadministrative website for database manipulation 3TechnologiesDatabaseMySQL Workbench 8.0APIExpress 4.17 and. Node.js 12.9BackendHosted on HerokuWebsiteReact. ApplicationUnity 2019.2Google Vision 4Requirements1.Database:ŁNeedsarobustimportfunctionthatcantakeaspreadsheetofcemeterydataandaddittothedatabase. :ŁScreenneedstoaddbranchofserviceandmiddlename\/initialŁResultsneedanotherbuttonaccesstheVeteransLegacyMemorialŁTheOCRoftheheadstoneneedstobecomemorerobustandsplitthemiddlename\/initialofftoaseparatefieldŁTheOCRoftheheadstoneneedstoworkbetteroncurvedtext4.Thecurrentversiononlyworksoncellphones.",
        "21": "",
        "22": "Initiatives GroupMAJ Oscar Gonzalez, Ph.D. Research PsychologistSGM GarricBanfield, CA Proponent Sergeant MajorType of Brief:  InformationDate:  31 August 2020Version:  1 2UNCLASSFIED\/FOUOŁSpecial Warfare Center and SchoolŁResponsible for Army Special Operations Force GenerationŁFort Bragg,. dog, cat) ŁData varies in purpose\/utility (i.e. prize vs comment)NamePetCityDateScorePrizeCommentjohndogNYC1\/1\/201710yescharmingjohndogDallas2\/2\/201810yesprettyjohndogLA3\/3\/20199nodifficultjohndogNYC4\/4\/202010yesprettyluiscatLA3\/3\/20198nohypermarydogNYC1\/1\/201710yesdocilebobcatLA3\/3\/20198nocharmingbobdogNYC1\/1\/201710yeshealthytomcatNYC4\/4\/20208noaggressivenichole dogDallas2\/2\/201810yescalm Mission: User-Defined Data BindingŁLink data horizontallyusing key variable (e.g. name). the order of the data, its output \/ format must be clean and leanID (Name)City_1Date_1Prize_1City_2Date_2Prize_2City_3Date_3Prize_3johnNYC1\/1\/2017yesDallas2\/2\/2018yesLA3\/3\/2019nomaryNYC1\/2\/2017yesbobNYC1\/3\/2017yesLA3\/3\/2019nonichole Dallas2\/2\/2018yesluisLA3\/3\/2019noID. the order of the data and format, analytical capabilities are needed:ID (Name)NYC-PrizeDallas-PrizeLA-Prizejohnyesyesnomaryyesbobyesnonichole yesluisno5101Add preceding dataNYC = 3, Dallas = 2, LA = 0 Mission Requirement: User-Friendly GUINamePetCityDateScorePrizeCommentjohndogNYC1\/1\/201710yescharmingjohndogDallas2\/2\/201810yesprettyjohndogLA3\/3\/20199nodifficultjohndogNYC4\/4\/202010yesprettyluiscatLA3\/3\/20198nohypermarydogNYC1\/1\/201710yesdocilebobcatLA3\/3\/20198nocharmingbobdogNYC1\/1\/201710yeshealthytomcatNYC4\/4\/20208noaggressivenichole dogDallas2\/2\/201810yescalmPoint and clickorDrag and dropMission Requirement:. User-Friendly GUI Identify data sequence (pre-established pathways, chronologically or other)Link data by."
    },
    "keywords": {
        "0": "computer engineering – software engineering pmp certified reza aria xi media llc august 26th internationally known project management certificatesix sigma certified computer engineering – artificial intelligenceb business administration – information systemsm 15 years ar projecta gamebase us 3 ai project placement xi media llcxi media daily reports – weekly usersdetecting inappropriate contentpattern recognition coolest technologies !- possibility camera 4 5 motivations com https :\/\/ flair internationally known certificate reza aria info 2020https :\/\/ flair process excellenceprofessional experience performance )- graduating full scalehigher level date industry knowledge 6 7 thank ar ). dr meetings project quality management reza ariaphd artificial intelligence ai ), virtual objects react native phone ’ mapsmart matching flairr dr augmented reality advanced applications ar app 2 ai dr app 2 ximedialabs work swift scrum sc questions provided lot learn job java ios hour graphics everyone development commitment codeandroid based apple active",
        "1": "active duty army officerboard certified nuclear pharmacistboard certified pharmacotherapist pharmd baminimal program language experience extensive first hand experience outside sourcesdod sourcesportable device printing capabilitymaster tracking notifications time …’ must haves portable devicesappin temperature monitoringbar code capabilities homeruns ability operational unit tracking medication really medications 19controlled substance accountabilitytemperature sensitive monitoring ‘ senior design pitch joe remesz dod proprietary systeminaccurate delays associated worldwide healthcareassistant professor usuhs expendable medical items throughout improper ordering applications covid ordering processat user level tracking paperorder entry outside sourcesfacilitates inventories sensitive item identificationability ordering trackingmaster trackinginterface training today ’ commercial products nice user input end user transit visibilitypoint supply levels multiple facets independent system export data currently serving accept data weight us seamlessly operate ms minimal guerrette bs barcodes alerts 2014",
        "2": "” features fall 2020complete initial interactive prototypeconduct patients timeline research team lindsay taliaferro lethal meansthis collaborative safety planning process youth suicide preventionconduct participatory design study human problem safety plans get lost key safeplan app design dashboard check reports app features required features support person messaging “ nice safety planning app suicide haves ” safety plan safeplan teen suicide prevention often completely discontinued post help required features passcode appspring 2021complete app development youth focus groups helping suicidal youth work collaboratively existing safety planning apps technical solution mobile app computer science kim gryglewicz solution digital safety plan display graphical data based ins every daytablet support current safety plans field study using meaningful graphical reports ., mswsocial work aesthetically pleasing design warning signscoping strategiesnetworks thrown awayflexibility issues security standardsdata visualizations second leading cause medicine pamela wisniewski timesupport person tool shared via pdf proven clinical intervention teen experiences changeslack complete interactive prototypefinalize view reports without get lost android apppush notifications interactive features safety plans “ nice people supporting teens safety plan technical problem existing design key activities digital plan computer science support person web app app review risk youth centered design support network support continuation dischargecurrent apps completing check complete check technical requirements pdf report clinical settingcommercialize teen needing suggestions based widely available testingsummer 2021 take advantage social supportstrategies sciences questions robust ios regular basisdesigned reducing access rds hardened professional resources population health larger displaysjournaling improve featuresupdate implementationprogress tracking health professions eventsaws backend encourage teens either tied destroyedcontinuous updates datapush notifications daily counter crisis services always right time teen teen ’ usually paper typically made biometric lock app youth design interactive reports person check ins help teen based without teens people notifications complete ’ time paper made lock write words user use updating updated unlock ucf triggers thoughts therapists therapistintuitive therapist specific send rethink reminders recommendations reach progress pin phone ph pdfreal make literature iterate identify guide g functional flexible fingertips feelings feedback faceid even engineering encouragingtemporary encouragement editing e done dischargeaccess discharge department death dayprogress datarecommendations create college clinicians care biometrics beyondconduct appstreaks allow ages adults accessible 24 10",
        "3": "spacesegment barrier retrieval algorithm improves hash space retrieval efficiency musical building blocks user registrationa database builder page option 3d spacea line drawn within building blocks would theoretically allow request new musican engine page deep mozart jacob galajdafaculty sponsor space using previous code3 .) api -> web app back model using previous architecture2 .) pytorch -> data gathering javascript -> web applicationback lstm deep neural networkdesigned classical string quartet songsegments chopin ). compatibility score web application handy skills one trained network loaded musical building blocks different music generation networksnice deep composer project overview deep composer project cont compare two composers together segment concatenation modelproject written figure proposal must haves create modernized mozart music space locally4 .) web application6 .) music creation page deep composer network test mozart model timeline 1 .) network architecture demonstrated preservedthe hash codes new mbb hash draw lines differently completely different set 3framework utilizes pytorchoverview develop web application segment hash codes project proposal develop provided music database songfour positional groups share generated songs create additional features linked segments form 3d space trained model music would music database 5 .) hashingthis figure different genre concatenated together songeach composer project front gather music submit songs groups creates example segment automatically create next segments still alive roles throughout restructure aifront nice flow much bias modern genre mobile devices great composersforwards feature arrays extensive multi endai development conveniently maintain backwards hashinghashed allows people ai code hashed segments end languages end development previous user python 2 option groupsthe collection drawnthese mbbs mozart hash new database back project composer application music written two segment haves create develop end python mbbs hashed collection way visualize utilize users used use train thank team system stored spaces similar server see runoffs recreate prevent possible points play platform overlap othergiving original models minds mind middle login likely kind kien instrument hua html host homepage friends finale experiment ex dr determined demonstrate css cross beginning available already 3",
        "4": "lockheed martin senior design swarm project © 2020 lockheed martin corporation fire control applied research team asks students autonomous navigationgps denied wayfindingrerouting around pop joseph rivera introduction lockheed martin missiles h449oijg2ky squad x https :\/\/ www lockheed martin poc joe rivera guide multiple long range anti objectives fully autonomous navigationswarm size either lockheed martin program threats https :\/\/ www dgm7hbcnmmu coordinating robotic systems resource constraints lrasm launch explore robotic systems computer science students systems engineer associatebsee autonomous swarm use visible cameras simulated urban area securitynavigating urban environments rights reserved prepared demonstrate novel solutions comparable framework ). machine learning topics lockheed martinexpertise squad x latest simulation technology competency simulating environments swarm navigation ship missiles project program demonstrates sensor exploitation rivera image processingjoseph hostile robot ground vehicles determined target deep learning central florida agent communicationmulti agent communication 5 agents 3 years students lrasm technology competency deep youtube watch v utility university time signal search ros reconnaissance pre opportunity lmco lidar inter gazebo future find drones disable develop destroy com associated ability 4",
        "5": "variables via visual scripting “ compile ” configured logic unity plugin clients workingedit mode synchronization workingdocumentation sample scene project goals rapid content iteration home run mixed reality capture mode xr technologies ever since summary amateur minimum requirements additional mobile app features performant without code generationcontrol project state time xr content prototyping tool dr save “ limited kinds ” oriented tech stackemulate 6dof controls c #) reach module system unity clientadd simple logic iterationincluding global state variables situprovides interface via smartphone configure global experience settings vr experiences without recompiling including necessary unity code background researching user experience interactive media departmentnicholson school xr platformsimport interactions discuss via zoom development via c shared reality experience collaborative fashion technologies allows multiple clients reality flow real friendly content development using obs questions support multiple users sufficiently prove dots remote collaboration videos john murrayassistant professoruniversity mongodbsqlitewebsockets nodejsunity3dhololens 2 rapidly develop ar android previous iterations mobile device additional featurescreate unity package unity data content authoring code generation scripting 2 iterations user testing allows applying xrfounded seebright travel style share projectstransition share position server program oculus quest magic leap iteration interaction patterns game engine edufeel free contact info central floridagames button mapping content state prototyping arbitrary models code c vr media ar android testing models worked viveios useful ucf typescript templates tablet skype showing scenes scenehololens runtime register publish orientation objects manages jtm interactivityused email created create connect communication color client boundaries alter allow add 2012",
        "6": "reinforcement learning based ai open source tools enhanced story capture int ’ l relationshipsgrow workforce customer focus ap video replay everglades current ucf program track 1 tech trendsharness external ip via sbirs follow outlined product requirements current status 3 topicsanalytics teamgame design teamartificial intelligence agent hierarchy 3 levels deep integration future arrive video organization air dominance accessible via referee api server updates continue cs senior design class focused blue force ai game run screen fall 2020 fiea ucf graduate course game phase 2 game characteristics 2019 agent hierarchy 3 levels deep user configures scenario choose ai illustrative lethality aka spectacular death5 transition business deep dive monthly fiea graduate student work1 team pending game lab course offering future ai game run screen computer science senior design capstone customerfunctions – program management cost rldata deliverylinux compatibility roadmap 2020 team leads presented overall vision game servergame server image renderer battle bots reinforcement learning introduce enhanced weaponry capable open ai gym interface linux compatibleopen ai wrapper current platform shall migrate game design focused students risktasks – understand lob senior staff new initiativesmissiles introduce compelling rewards scale3 fire control student projects capture focused organization program shall utilize work match emerging business opportunities deliver high quality concepts backdocker container linux build transitions profitable development projects tactical missiles advanced programs sp mission – create program shall run cs capstone course open gl renderer 2 semester program4 teams improve fall 2020 project everglades helping continue battle rhythm graduate levelproject manager rebecca broadwayproduct management compete server settings produce early concepts drone swarm capability6 creates new ideas benefit mfcplace longer 12 peopleteam shall tournament bracket logic allow multiple ais enhance node network2 due march 4 game roadmap customer problems screen 2 ucf goal 1 semester referee port red force october 2019 screen 5 agile focus advanced programs sp projects 2 teams tournament interface python api api change topics 1 tasks ap system ap sp mission 2020track 2 new initiatives high level special programs 12 weeks game design emerging technologies allow players allow games ucf sp portfoliowork working code term bets space environments self organized self directed played back missile defense large opportunitiesinterface innovation engine graphics design2 following capabilities final presentations environment selection enhance graphics developing customerscapture approach visionap addressalign international 4 sprints3 server focus air ap 1 vision work development build teams emerging sp enhance 4 videos updated universities targeting submarine sub start sea schedule reynolds rest randomness purpose prototypesbuild prototypes programmers producers prioritizing performance people offsets mourad miller mfc mature lobsapproachaggressive learn land k j iterate invent introduction h gurley gsprograms graphs functions fisher develop designs conceptscreate comprised communicate combat c brown botwinik bd ar align aggressive added 31",
        "7": "correct programs verifyincorrect programs give appropriate warnings possible extensions extensions loop daikon ajmlc runtime checkedclass file correctness proof color java formal methods jml annotated java public class color \/\/@ public invariant 0 <= green && green \/\/@ public invariant 0 <= blue && blue \/\/@ public invariant 0 <= red && red 3rd party annotations helpful background cop 3402 public \/*@ pure @*\/ int getred () unsplash current approaches coding standardscode reviewstesting photo comsources :~ 11k files (+ 4k openjdk )~ 2k directories (+ 1k \/*@ spec_public @*\/ private int red amount ); @*\/ public void adjustred \/*@ requires 0 <= red int sum public void adjustred method adjustred public void adjustred public static final int saturated code openjml tool extends openjdkhosted verify programs using stringsconnect formal verification verification steps jdkbetter jdk specificationsjava annotationsintegration newer smt solver versionsz3cvc4experiment testing “ program testing data trace file improving java verification result == red red += amount newer smt solversexperiment reputationsecurity breaches photo absence .” photo unsplash problem software ensures red == verify programs prover cannot establish logic coursescop 5021 eduhttp :\/\/ www 10 ): 576 \/\/@ ensures \/\/ ...} www summary fix openjml 2020 problem software computer programming ” method adjustred int amount edu \/~ leavens string program verificationcheck 1969 jml cop 4020 color openjml tool return red assignable red unsplash limits …) photo green blue java correct point verification org openjml openjml gary systems software string programsmodify programming languages specify program program analysis logicconvert program red …) science …) mission …) healthcare …) business needs work medical devices logical statementprove jmldoc key instrumented version failuresdeathinjurymonetary lossloss edsger dijkstra discrete math daniela santos critical systems cot 4210 climate models best show axiomatic basis august 31 associated declaration use stringsdetails openjdk saturated amount verification “ program leavens use wocintechchat wiki warning ucf trust tools timur spacecraft solution r presence part overflow overall old oct nonnull never lead jmlworking jmlspecs invariantexit hoarecacm github floating float everywheresafety esc errors doubleprograms cs connect com christina cars c2 c busses bugsbugs banking assertion arithmeticoperationrange 583 4 256 12",
        "8": "florida space institute computer science senior design project 2020 simulation exploration experience unity 5some 3d modeling experiencebasic system operations experience desired parse knowledge management services 2 see ucf cs 2021 goals build virtual 3 rassor robots 4 previous lunar see events virtualprovide distributed simulation capabilityindustry standard distributed computing tools autonomous lunar construction see 2021 goals simulate mpc xml interfacedevelop virtual space mission april 2021with nasa subject matter experts ucf developed ros simulations exist solve space exploration problems teamgame development desired working rassor robotic swarmthat builds write xml dataus citizenshipfor deploy simulation infrastructureiee 1516 6 see process develop distributed visualizationuse nasa tools visibility create something — support see 2021teach others robotsprovide 3 rti servers capture plume ejectathat builds space institute supportprovide nasa game based visualizer lunar base elementspresent results see project requirements help inform mars planning university international teamworkprofessional network international partnerswith nasa mentor simulation system -- nasa space exploration support see 2021 expandingenhance 2020 rovers nasa exploration communitysimulation distributed observer network rassor robot behavior see 2021 distributed computing working mars baseinter present outside nasa nasa studiesif possible provided interlocking blocks high level architecture international student teams including terrain impacts govern site visits c ++, java power management lunar base space port simulation infrastructure pitchdon 3 see teams lunar night lunar launch robots safe industry tools international teams build nasa integration development teams simulation mars baseintegrate nasa concepts see opsadd terrain languages c landing site cloud servers self sufficient rover modelsintegrate robots protective berm productssystem infrastructure othersadd sophistication landing pad fuel production different classes complex information ai governance tools hla evolved april evolved concepts cloud windows well vpncollaboration value used us uk technologies skills read pythonhla note modelsbuild mak maintenance linux keeps italy interact germany france ez event enhanced deflect credibility covid controlintegrate charging capability canada bulgariaevent brazil autonomously 1",
        "9": "ucf marine turtle research group four main projectsbeach monitoringin water coastal nettingoffshore capturenesting surveys – 3 new new new mtrg mtrg mtrg automatically check box oceanic juvenile research whole – life history approach mtrg atlanticocean sebastian inlet trident basin coastal sampling “ owner ” problems export interface requirements must stahelin offshore sampling data use scientific advisory servicepost ucf marine turtle research group photos veterinary experienceoutreach current database — problem photos 3 old new old mtrg mtrg crawl countsstandardized data collection since 1982tags ucf mtrg nighttime surveys photos atlantic sea turtle nesting happens full capabilitiesdevelop phone browser interfaceability available database techkey data reported phillips daytime surveys photos coastal juvenile research11 field station new database enter data chronologicallydatabase grew km standardized survey areas analyses like stable isotope scratch – hosted determine capture type tag automatically check boxes seney nest inventories photos ucf mtrg development previous students developed recapturestrange encounter new implement new features new encounter tag nourishment monitoringprovide data mansfield current database problems check nests laid photos nesting beach research37 spill assessmentsrobust analyses store scanned documents require annual renewals plus … capacity partially implementedhome run atlanticocean photos new database generate customizable reports specific document stored clunky remote access individual identificationmorphometricsmetadatadaily number research track individual turtles track data requirements nice new tags previous students web browser individual turtles tag loss 2 tag 1 tag stahelin generate reportsneed track fate old nest success nest numbers study area species recoverypartnerships samples collected rearrange fields photos older entries neededprogramming language link records graduate researchfield gis featuresability fix issues federal agencies browsers allowed brevard county based training area surveyed already implemented agency deliverablesfeature access itability abernethy 37 multiple tags database etc .). nest turtles stored number mansfield access tags etc ’ years work usfws used undergraduate time state results remove relationalunable r query project pre post oil noaa nmfs mills long limited limit licenses layout k juveniles j improve half grow genetics g fwcc educationplatform e diet decades contracts construction conservation computers comments cloud changes chabot c awsgoal add acoe ability 33 20",
        "10": "solar shade study building program study ….. recreate tests measuring public lifestationary activity mapping better placemaking part 1 part 2 part 1 community driven placemaking public places gone bad better placemaking part 1 part 2 measuring place collecting public behavior viewer using onsite augment reality “ placemaking ” process measuring place part 2 members wanting pedestrian friendly interactive experience exposing residents place collecting public reaction survey collecting public voice crowd gathering cultural hubs touchable graphic interface bonus view potential physical projects graphs using data collectedcreating place part 2 site ar designs options make better places developer driven projects part 2develop new part 1 measuring place create potential local projects “ places ”. virtual blocks could pre rendered images people moving counts impower local officials gathering local ’ public opinion data part 2 place digital content measured space relative opinion creates direction qualty placemaking public place public places part 1develop building lot community leaders using gps apple using place great place create successful places record voice dynamic view design options measured qualities digital engagement 400 ’ gathered data analyze data designs provided opinion question walk insideclickable walk around urban fabric upon finishing ucf architecture test results surveyed opinions stable enough specify areas record observed next person mobile application layer maps hyper geolocation hot points google maps existing conditions create charts comment opportunities chartsadd points biggest impact backend technology backend tech additional information 2 viewable vertically see image community viewer places models must site bonus data designs opinion create viewable see must models worked voting views viewed videos users use towns tool text tear tablet switch striving set relationship rank project presented portion pipeline phone participants outsidebonus outputs others opinionqualtrics objects need middle measure markers makes lockable located lines left lead known interact identity headset goal get gather futures findings example e downtown creating communities collected cities buy buildings broken arranged android analise amongst algorithm able",
        "11": "class computer science senior design project fall 2020 plume ejecta lunar tools – pelt iiez rassor pelt ii – plume ejecta lunar tools two 2 moving really realy fastlike driving reliably analyze lunar launch speedsomeplace includes kilometers away many kilometers per secondthere 5 pelt ii entire landing look like gatewaystation orbit pelt 3 pre pelt kilometers upsome speed worsemuch worsewe need themhttps :\/\/ www large propulsive lander landing impacts across hide behind something 3d user interface particle collision detection florida space institute 4 moon local pelt rassor landing sites think starship surface interactions runtime optimization raining dust rain storm phil metzger moon area including particle groundthe debris go someplace erosion rates environmental inputs dynamic landings dramatically increase cislunar environment 6 questions 2d system 200 mph space particle moon youtube youtu windshield watch v using stuff still share shaders save quickly product pi opposed needs nasa moonthere lot know kind kick integration hole hitit hit happening ground goal give file feature dr displays create communicate com big aup6kwydo_q archive analysis ability 7",
        "12": "webcourses using manual rubric alignment project goals provide instructor unity projects includes building project using virtual machine web interface home run connect project fully handles registering student git repositories undergraduate levels summary instructor javascriptmongodbvscode extensionswebsocketscanvasrestful api nodejsunity3dpythonc existing intelligent tutoring research server minimum requirements teacher gitdocker current state server background researching user experience codefeel practical programming tutoring interactive media departmentnicholson school current test results independent reach vs code extension custom vs code extension friendly programming behavior analysis friendly web interface handles github webhooks git repositories linked sends test results existing test frameworkresults servervs code extension test casesprovide students system designincorporates test lack thereof ). john murrayassistant professoruniversity ensure reliability questions discuss via zoom grading system dr editor advice based student activity logserror errors observedtrack progress provide details based assessment approaches instructors managing students certain assignments technologies code extension student experience vs code student based unity testframework unity plugin ta interface webcourses test models programming assignments independent modules git repos instructor individual analysis activity analysis topics based git repository certain patterns automated grading selecting assignments create assignments xrteach intro view tutorial typing speed three languages session details node architecture logs events intervention toolbuilds error rate edufeel free databaseunity plugin content authoring contact info configuring rubrics compiler errors central floridagames running tests automated tests support two suggest videos event notifications bash script unity interface server vs programming media technologies managing instructors errors assessment activity tests videos support repository notifications bash webview vscode vr use updates ucf typescript time technology submissions submission skype set self saves react pythonreact python problem posted panel monitors mongodb jtm javascript gui group graduate frameworks feedback etc email customizable component communication communicates commits comments classes change c built ar activities access 3 1",
        "13": "cecs senior design project assignment process faculty team assignments student self selection mae iems ece cs",
        "14": "requiredbonusquestions 2 persistent cyber training environment 3 pcte description 4 pcte details 5 pcte testing 6 api testscontract testsload persistent cyber training environment testing bruce caulkins glenn martin amit kapadia agenda pctepcte testingkrewhat ’ scaling testsautomated testing pcte automated testing 7 api testscontract testsload based docker containerschedules tests using os servicescreates batch operations ci pipelinebut also within cd pipelinesoftware bugsintegration bugsimage credit global parametersprogram would leverage katalon apis 10 bonus katalon studio gui 11 closing slide questions cd pipeline continuous integrationcontinuous deliveryour focus pcte platformruntime engine executed within automated testing paradigmsbonus extension ideas scaling testsautomated testing ci automated testing tools katalon 8 katalon studio control multiple executionsexecutes tests black vs goldkre works integrate new runtime engine headless environment leverage execution profiles placeuse tests developed also xml files webdriversfirefoxedgeshow running within new runtime engine runtime engine used required two teams perform actionschrome used distributed servers 9 cs design project ’ testingparticularly within cd pipelines cd pipelinejenkins katalon studiotests existing ci xml files katalon test suites support development groovy scripts gets exposure ci ucf testers domain … … ucf xvfb wrote webdriver ubuntu tie stored set program perhapssupport mostgrouped lot linux leverages known ist issues goal essentially edumartin edu create call bcaulkin",
        "15": "class computer science senior design project fall 2020 plume ejecta lunar tools – pelt iiez rassor pelt ii – plume ejecta lunar tools two 2 moving really realy fastlike driving reliably analyze lunar launch speedsomeplace includes kilometers away many kilometers per secondthere 5 pelt ii entire landing look like gatewaystation orbit pelt 3 pre pelt kilometers upsome speed worsemuch worsewe need themhttps :\/\/ www large propulsive lander landing impacts across hide behind something 3d user interface particle collision detection florida space institute 4 moon local pelt rassor landing sites think starship surface interactions runtime optimization raining dust rain storm phil metzger moon area including particle groundthe debris go someplace erosion rates environmental inputs dynamic landings dramatically increase cislunar environment 6 questions 2d system 200 mph space particle moon youtube youtu windshield watch v using stuff still share shaders save quickly product pi opposed needs nasa moonthere lot know kind kick integration hole hitit hit happening ground goal give file feature dr displays create communicate com big aup6kwydo_q archive analysis ability 7",
        "16": "educationregolith advanced surface systems operational robot 1 rassor combines nasa kennedy swampworks licensed designs like fl poly ¼ ton rover mission elementsthe mobility platforms consume mission elementsthe challengedevelop inexpensive … integrate ucf developed year commodity computing hardwarecomputer easymost robotic projects need ucf student developed ez project resources leaving little open source softwareadd software rassor softwarebuild control software nasa sservi collaboratorand extensible mobility platforms open source hardware mission elements 2 stepper motor interfaceez goala common hardware florida space grant first years 3 every future project 500 pound robot fsi robotics projects work togetherin simulator nvidia nano boards fl poly little robot rassor software mobility platform robot parts project 4 rassor team rassor robots rassor research work againput way around use across teach others steam education softwarea collection significant portion robots teams multiple robotscoaching live environment execute missions auto nav 5 questions wifibuild ai ai controlmake needs associated robot rassor software projects ez control work nano ai research needs well user trivial thanked test system stem scratch satisfy person needed mixbe mega meet make let join human fund forever focus find drivedrive code check built build available anyone amazon add 6",
        "17": "teach programming gaming devices teach 3d camera touch nintendo 2ds homebrew homebrewed tic tac toe tic-tac-toe maze pong code scratch peer-to-peer peer comprehensive story multiplayer alhorithms paul gazzillo",
        "18": "right attribution 9thedata 101 digitalresearch7 8quotationresearchjohnson used quotes wordswhenthetextwouldn ™ tfitwithintheareanecessaryintheprinteddictionary requirements 11exampleoutput 121 quotationsfromjohnson ™ sdictionaryamylarnergiroux identifyappropriateonlinecorporalikegutenbergwhereworksbytheauthorwouldbeavailablelikeearlyenglishbooksonline ), projectgutenberg determinewhetheryoucanprogrammaticallyquerythosetextsonlineorwhetheryou ™ llneedtohaveadownloadprocess3 alinktothelibraryofcongress ™ slinkedopendatafortheauthor would paraphrase stretchgoals 13questions show examples use usage ucf thematchscore thecorpustouseforcomparison scoreyourmatchesandoutputthetop5perword quotesometimeshewouldmisidentifythequote phdconnieharperucfcenterforhumanities outputaspreadsheetthathastheinputdataplusthetitleoftheworkyoufounditin org libertyfund haveauithatallowstheusertoselectaspreadsheet hathitrust2 harper educonnie edu createanalgorithmwithsometypeoffuzzysearchortextreusetolocatepossiblematches aseconduithatallowsausertostepthroughtherowsfromtheoutputspreadsheetandhaveitdisplaytheoriginaldictionaryquoteandthenthescoredquotesthatwerefoundandthenallowtheusertopickwhichofthe5isthebestmatchandflagthatsomewayintheexcelfile archive andtheactualtextofthequoteyoufound andanoutputdirectoryfortheresults amyg alinktotheonlinetextinwhichthequotewasfound 5 4",
        "19": "least one paragraph minimum per team member cop 4934 initial project proposal solution may face going forward aws ), mobile app development research œ block design approach total page count limited conquer create one document website graphic design costs group member administratively responsible construct separate block diagrams initial project identification documentation completed œ block design single complete block diagram potential software licensing costs project impact underrepresented groups level containing additional detail detailed project block diagram design œ block prototype œ block acquired œ meaning acquired œ block design boot camp giving brief definitions title ﬁbroader impactsﬂ requirements document divide improved national security project block diagrams member 2 ™ member 1 ™ project narrative description separately labeled section patents use drawings many quantitative measures finished prototype 4 various pieces communicate conceptual discussion specific project descriptive title avoid using ﬁnumbersﬂ team members 1 paragraph group member level diagram block diagram project ), design criteria software diagrams potential solutions may consist color may block status project software nested diagrams project milestones project hardware project budget additional information title ﬁlegal hoekstra ™ group members various aspects improved education block name block 5 project high short description much detail legal description whole ), cloud ), project sponsor would increase within science usually qualitative use descriptions specific implementation significant contributors red rectangles public engagement prototyped f profit organizations privacy issuesﬂ personal interest output associated original problem one named entities minimum low power low cost increased participation identifier grouping following content expanding upon events occur enhanced infrastructure diagram legend code repositories clearly indicate broader implications brainstorming discussion blue rectangles based services 3d assets 15 pages stem fields stem areas information provided high resolution purchased c must include donated b designed e autonomicﬂ etc design solution mobile block project impact identification diagram detail software ﬁnumbersﬂ using use section requirements many discussion descriptive communicate 4 2 1 stem information high whole sponsor purchased name legend include implementation etc e donated cloud 5 ﬁworkﬂ ﬁlightweight ﬁideasﬂ workforce words well verify values understanding think text technology sure subsection stems statement state sr specifications sometimes society server series semesters see sections scalable running remember questions programmable possible portable peer part often objectives non motivation might metrics means maintaining long local listing list issues investigated interfaces input including illustrates helpful goals global g function flexible financing figures explore expand examples example evaluate ethical environment either drawing draw dr diversity disabled directions determined describes describe dealt dates currently contains contain constraints connections component complex communicating client charges blocks best appropriate applicable answer also agreed acronyms accurate 7 6 3 2d ).",
        "20": "digitalresearch1 2cemetaryœcurrentiterationcross platform mobile appprovides 2d navigation database manipulation 3technologiesdatabasemysql workbench 8 3d ar navigation veteran cemeteriesallows switching various lighting conditions searchingallows dynamic scanning read headstone text headstoneuses ocr scanning 9mobile applicationunity 2019 2google vision 4requirements1 websitedeliveredasadockerfilesothatitcanbemovedfromherokutoaucfserver stretchgoals51 user nears js 12 herokuwebsitereact 16 haveitworkonwindows10tablets questions angleshasapreliminaryadministrative website 0apiexpress 4 database ﬂausercouldspecifyacemeteryandtheirappwoulddownloadittotheirphoneandthenallowthemtouseitoffline łscreenneedstoaddbranchofserviceandmiddlename łneedsotherfieldsaddedtomakeitcompatiblewithanotherproject2 łneedsawaytoremovesetsofrowsversusasinglerowatatime łneedsarobustimportfunctionthatcantakeaspreadsheetofcemeterydataandaddittothedatabase ucf thereneedstobedownloadablecemeteryﬁpacks thecurrentversiononlyworksoncellphones selectacemeteryandremoveallitsrows sections phdnationalcemeteryadministrationucfcenterforhumanities node needstohavethedatabase itneedstobecomeresponsivetoworkonipadsofvarioussizes initialłresultsneedanotherbuttonaccesstheveteranslegacymemorialłtheocroftheheadstoneneedstobecomemorerobustandsplitthemiddlename initialofftoaseparatefieldłtheocroftheheadstoneneedstoworkbetteroncurvedtext4 g edu6 e createatourmodewherethedatabasehaswalkingtoursdefinedthathaveasetofgravesitestovisitinaspecificorderasdefinedbythepersonwhosetsitup cemetaryaugmentedrealityenhancementsamylarnergiroux appsearchcriteria amyg 9backendhosted 5 3 2 17",
        "21": "nicolas lacognata brandy king computron instructor game gaming gameplay programmer 2d puzzle webgl unity teach gamifies thinking computer science c# aws vcs industry standard git perforce ux",
        "22": "friendly guiœexecute basic descriptive statistics œprovide clear outputœallow army special operations force generationłfort bragg defined data bindingłlink data horizontallyusing key variable defined data bindingłlink data horizontallyby key variable generate business inteleasily repeating variables warrant special considerations friendly gui identify data sequence initiatives groupmaj oscar gonzalez fouosenior design pitch briefers ca proponent sergeant majortype prizejohnyesyesnomaryyesbobyesnonichole yesluisno5101add preceding datanyc previous c2c )? 7 defined data bindingłbeyond defined link order timełdata includes scores research psychologistsgm garricbanfield prize vs comment maj linda chung least one entry fouołspecial warfare center focused software featuring export datasets conditions entered competition across 31 august 2020version key variable łdata file structure determinedbinding order œuser 201810yescalmjohn johnjohnjohnluismarybobbobtomnichole mission exportable dataset 11unclassfied coast 2 coast 0 mission requirement many total participants link data friendly guisimple friendly guinamepetcitydatescoreprizecommentjohndognyc1 determined variable specific sequence prizejohnyesyesnomaryyesbobyesnonichole yesluisnogoodbetter łdata varies many participants dropmission requirement data link datałuser c2c repeats c2c )\" 201810yescalm mission łlink according recappolicyconsiderations warranteduser prize_1prize_2prize_3johnyesyesnomaryyesbobyesnonichole yesluisnonote pet owners overall classification nyc2020 excluded multiple entries many participated different pets commander ™ chronological series bind łuser analytical capabilities 20208noaggressivenichole dogdallas2 2019nonichole dallas2 10 entries la2019 łnote see dates format must established pathways clean reports 6 people 1 2unclassfied la2019 id variables user may 3 cities order mission c2c many dataset 2 la2019 user may id format established dates clean cities 6 3 1 œcapability łparticipants łex łevents yes utility us unclassified schoolłresponsible rows repeat reliablymission quickly purpose prizes prizela prizedallas pre ph output objectivełdata nyc2017 nyc note needed need ncwho namepetcitydatescoreprizecommentjohndognyc1 name leanid labels la johndognyc1 involved informationdate given g fouoquestions e dog distribution distinguished definitionid definition dallas2018 dallas compete columns clickordrag city_1date_1prize_1city_2date_2prize_2city_3date_3prize_3johnnyc1 city chronologically categories cat casesłexample c2c19 brief bob _2 _1 5 4 202010yesprettyluiscatla3 2019nonamepetcitydatescoreprizecommentjohndognyc1 2019nomarynyc1 2019noid 20199nodifficultjohndognyc4 20199nodifficultdognycnamepetcitydatescoreprizecommentjohndognyc1 20198nohypermarydognyc1 20198nocharmingbobdognyc1 2018yesluisla3 2018yesla3 201810yesprettyjohndogla3 201810yesprettydogla3 201810yescalmpoint 2017yesla3 2017yesdallas2 2017yesbobnyc1 201710yeshealthytomcatnyc4 201710yesdocilebobcatla3 201710yescharmingjohndogdallas2 201710yescharmingdogdallas2"
    },
    "text": {
        "0": "\u000b\u000b\u000b\u000bFLAIRR\u000b\u000b Dr. Reza Aria XI Media LLC August 26th, 2020https:\/\/flair.app  2 Who?XI Media LLCXI Media is active in development of advanced applications in Artificial Intelligence (AI), and Augmented Reality (AR).Dr. Reza AriaPhD:  Business Administration – Information SystemsM.Sc.: Computer Engineering – Artificial IntelligenceB.Sc.: Computer Engineering – Software Engineering PMP Certified: Internationally known Project Management CertificateSix Sigma Certified: Internationally known certificate in Quality Management & Process ExcellenceProfessional Experience: More than 15 years AR ProjectA gameBase of the app (React Native)CodeAndroid (Java)Apple\/iOS (Swift)Graphics = Provided by us 3 AI Project        Placement of virtual objects on the mapSmart Matching of usersDetecting inappropriate contentPattern recognition on the phone’s camera 4 5 Motivations for YOU           - Learn a lot about AI & AR- Work with the coolest technologies!- Possibility of a Job (based on Performance)- Graduating with up-to-date industry knowledge   How?SCRUM:  Daily reports – Weekly (2-hour) meetings Project: full scaleHigher level of Commitment: for everyone! 6 7 Thank you!Any Questions?Dr. Reza Aria  info@ximedialabs.com https:\/\/flair.app ",
        "1": "Senior Design Pitch Joe Remesz-Guerrette About Me Active Duty Army OfficerBoard Certified Nuclear PharmacistBoard Certified Pharmacotherapist PharmD, MS, BS, BAMinimal program language experience  Extensive first hand experience with multiple facets of US and worldwide healthcareAssistant professor USUHS (2014)Currently serving in an operational unit Tracking Medication  Really medications and expendable medical items Throughout the ordering processAt user level (supply levels)Independent system that any end user can operate with minimal\/no training Today’s tracking PaperOrder entry into DOD proprietary systemInaccurate Delays associated with improper ordering Applications COVID-19Controlled Substance accountabilityTemperature sensitive monitoring‘Just In Time…’ Must Haves Portable devicesAppIn-transit visibilityPoint of ordering trackingMaster trackingInterface with commercial products Nice to Have Temperature monitoringBar code capabilities Homeruns Ability to export data (seamlessly) to outside sourcesDOD sourcesPortable device printing capabilityMaster tracking notifications (alerts)Sensitive item identificationAbility to accept data from outside sourcesFacilitates inventories by weight, barcodes, user input",
        "2": "Safeplan Teen Suicide Prevention and Safety Planning App Suicide is the second leading cause of death for youth between the ages of 10-24.Safety plans are a proven clinical intervention where suicidal youth work collaboratively with their therapist to identify:Triggers and Warning SignsCoping StrategiesNetworks of Social SupportStrategies for reducing access to lethal meansThis collaborative safety planning process is usually paper-based. The Human Problem Safety plans get lost: Current safety plans are done in person and on paper, and get lost or thrown awayFlexibility issues: They don’t allow for updating\/editing over time as the teen experiences changesLack of feedback: Not very interactive or encouragingTemporary: Care is often completely discontinued post-dischargeCurrent Apps not made for teens: They are typically made for adults and are not youth-specific The Technical Problem The Solution Digital safety plan: Safety plan is accessible through an app on the teen’s phone, won’t get lost or destroyedContinuous updates: Digital plan is more flexible, can be updated by teen on a regular basisDesigned for teens: Youth focus groups helping to guide the design and implementationProgress tracking: Interactive features to encourage teens and support continuation of use, even after dischargeAccess to crisis services: Help is always right at the teen’s fingertips, even after discharge The Technical Solution Mobile App: A robust iOS and Android appPush Notifications: Reminders and notifications for key activities\/eventsAWS Backend: RDS hardened to the UCF IT security standardsData Visualizations: Meaningful graphical reports that can be shared via PDF to the therapistIntuitive and Aesthetically Pleasing Design: User-centered design is key Safeplan App Design Dashboard Check-In Progress\/Reports App Features Required features and “Nice to Haves” Safety Plan: Create a safety plan with or without a support person (e.g. therapist)Check-Ins: Complete a check-in at any time during the dayProgress\/Reports: Display graphical data based on check-ins and send a PDF report with this same dataRecommendations: Words of encouragement and suggestions based on check-in dataPush Notifications: Reminders to complete check-ins and recommendations (above)Support Network: Reach out to people and professional resources for help Required Features Passcode\/Biometric Lock: Use a pin or biometrics (e.g. FaceID) to lock\/unlock the appStreaks: Daily counter for completing check-ins every dayTablet Support: Rethink the existing design to take advantage of larger displaysJournaling: Write down thoughts and feelings, either tied to a check-in or at any timeSupport Person Tool: Web app (for a therapists or other people supporting teens) to view reports without the teen needing to send a PDFReal-time teen\/support person messaging “Nice to Have” Features Fall 2020Complete initial interactive prototypeConduct a literature\/app review on existing safety planning apps for youth suicide preventionConduct participatory design study with at-risk youth to iterate on and improve featuresUpdate and complete interactive prototypeFinalize the design, functional, and technical requirements of the appSpring 2021Complete app development and testingSummer 2021 and BeyondConduct a field study using the app in a clinical settingCommercialize the app to make it widely available to clinicians and patients Timeline Research Team Lindsay Taliaferro, Ph.D.Department of Population Health, College of Medicine Pamela Wisniewski, Ph.D.Department of Computer Science, College of Engineering and Computer Science Kim Gryglewicz, Ph.D., MSWSocial Work, College of Health Professions and Sciences Questions?",
        "3": "Project:\u000bDeep Mozart Jacob GalajdaFaculty Sponsor:Dr. Kien A. Hua If Mozart was still alive, what kind of music would he create? Project Proposal Develop an application that allows people to create modernized Mozart music.In this project, we will utilize the Deep Composer network. The Deep Composer Project Overview: Feature arrays for each instrument are concatenated together before hashingThis figure is an example segment of a classical string quartet songSegments are hashed to prevent as much bias as possible so that the mind of the composer can be preservedThe hash codes for each segment are stored in the previous and next segments The Deep Composer Project cont.  A collection of these two-way, hash-linked segments form a songFour positional groups (Beginning, Middle, End, Finale)Runoffs between groups creates a nice flow between groupsThe collection of all segment hash codes is the hash-spaceSegment Barrier Retrieval algorithm improves hash-space retrieval efficiency Musical Building Blocks (MBBs) We visualize the hashed segments as Musical Building Blocks that can be drawnThese MBBs are points in a 3D spaceA line drawn within this 3D space can be used to demonstrate a songEach composer will draw lines differently from each otherGiving a composer a completely different set of building blocks would theoretically allow the composer to play a different genre of music The Deep Composer Project cont. Extensive Multi-LSTM Deep Neural NetworkDesigned to recreate the minds of great composersForwards and Backwards HashingHashed-Segment Concatenation ModelProject written in Python 2 and 3Framework utilizes PyTorchOverview of network architecture demonstrated in the figure Proposal Must haves:A homepage for login and new-user registrationA database builder page option for the user to submit songs to automatically create their own music database. Users can use the system-provided music database, their own or both.A music creation page for the user to request new musicAn engine page for the team to conveniently maintain and experiment with different  music generation networksNice to haves:Application is cross-platform and available to mobile devices.Option for user to share generated songs with friends.More than one trained network loaded in server (Ex. Mozart and Chopin).Compatibility score: Compare two composers together to see how similar they are. Timeline 1.) Train a composer (Mozart) model using previous architecture2.) Gather music from a modern genre to create a new MBB hash-space using previous code3.) Test Mozart model with new MBB hash-space locally4.) Develop web application to host  the trained model and hash-spaces (original and new MBB hash-spaces)5.) Develop more models & hash-spaces for web application6.) Create additional features for the web application Handy Skills for Project Front-End:HTML, CSS, JavaScript->Web ApplicationBack-End Development:Database and API->Web App Back-EndAI Development:Python 2 & 3 with PyTorch->Data Gathering\/Restructure AIFront and Back-End languages will be determined by the team. The AI code has already been written in Python.There will more than likely be overlap with these roles throughout the project. Thank you!",
        "4": "Lockheed Martin Senior Design Swarm Project © 2020 Lockheed Martin Corporation. All Rights Reserved Prepared By: Joseph Rivera Introduction Lockheed Martin Missiles and Fire Control Applied Research team asks students to develop an autonomous swarm of drones and\/or ground vehicles to search and destroy a pre-determined target in an simulated urban area.Students will demonstrate novel solutions to SWARM navigation, inter-agent communication, competency with ROS, and competency simulating environments with Gazebo (or a comparable framework). Objectives Fully Autonomous NavigationSwarm Size of 4-5 Agents (Drones and\/or Ground Vehicles)Inter-Agent CommunicationMulti-Sensor Exploitation (use visible cameras and LIDAR)Ability to find and disable a hostile robot under time\/resource constraints LRASM Launch and guide multiple Long Range Anti-Ship Missiles (LRASM)Autonomous NavigationGPS Denied WayfindingRerouting around pop-up threats https:\/\/www.youtube.com\/watch?v=h449oIjg2kY Squad X https:\/\/www.youtube.com\/watch?v=DgM7hbCNMmU Coordinating Robotic Systems for Reconnaissance \/ SecurityNavigating Urban Environments Why This Project? Computer Science students will have the opportunity to explore robotic systems, Deep and Machine Learning topics, and the latest simulation technology.This project is not associated with either Lockheed Martin program, but each program demonstrates the utility for this technology in the future (LRASM, SQUAD X) Lockheed Martin Poc Joe Rivera, Systems Engineer AssociateBSEE, University of Central Florida~3 years with Lockheed MartinExpertise: Deep Learning, Signal & Image Processingjoseph.rivera@lmco.com",
        "5": "Reality Flow Real-Time XR Content Prototyping Tool Dr. John MurrayAssistant ProfessorUniversity of Central FloridaGames and Interactive Media DepartmentNicholson School of Communication and Media My Background Researching user experience and content authoring in AR\/VR\/XRFounded Seebright in 2012, and have worked with XR technologies ever since Summary Amateur-friendly content development\/prototyping in situProvides interface via smartphone\/tablet to alter\/add\/save “limited kinds” of content and interactivityUsed to rapidly develop AR\/VR experiences without recompiling in a collaborative fashion Technologies:TypeScript\/C#MongoDBSQLiteWebsockets NodeJSUnity3DHololens 2\/Magic Leap\/Oculus Quest\/ViveiOS\/Android Previous Iterations (2 iterations) Created a server program that allows multiple clients to connect and share position\/orientation\/color of objects in a sceneHololens, Android and Unity Plugin clients workingEdit Mode synchronization workingDocumentation & Sample Scene Project Goals Rapid content iteration for VR & XR PlatformsImport interactions into game engine for further scripting\/development via C# code generation OR sufficiently prove DOTS is performant without code generationControl project state for user testing\/iterationIncluding global state variables and scenes (models + state) Minimum Requirements Additional Mobile app features:Support multiple users and allow them to create\/share projectsTransition to Unity Data-Oriented Tech StackEmulate 6dof controls with mobile device for testing\/iteration in Unity clientAdd simple logic & variables via visual scripting“Compile” configured logic into code (C#) Reach Module system for additional featuresCreate a Unity package that manages (templates, register, publish) interaction patterns (including necessary Unity code) and allows applying them to arbitrary models at runtime.Configure global experience settings in client (Button mapping, travel style, boundaries) Home Run Mixed Reality Capture mode for showing off the shared reality experience (Useful for remote collaboration videos) using OBS Questions? Contact Info:jtm@ucf.eduFeel free to email me to discuss via Zoom or Skype",
        "6": "Rebecca BroadwayProduct Management, Senior Staff\u000bNew InitiativesMissiles and Fire Control Student Projects An Introduction to AP \/ SP and \u000bProject Everglades Helping the Future Arrive Video Organization Air Dominance(S. Fisher) Tactical Missiles Advanced Programs(H. Mourad) S&GSPrograms(S. Botwinik) Air & Missile Defense(C. Brown) Special Programs(K. Gurley) New Initiatives(A. Miller) Advanced Programs & Special Programs(J. Reynolds) Vision & Approach VisionAP\/SP is an aggressive, capture focused organization \u000bthat creates new ideas and transitions profitable \u000bdevelopment projects to LOBsApproachAggressive and agile  Focus on prioritizing, targeting, developing customersCapture, mature, and transition business Deep dive monthly on customer problems to learn, focus, and addressAlign International\/Offsets with AP\/SP projects to benefit MFCPlace longer-term bets on emerging, large opportunitiesInterface with AR to align with tech trendsHarness external IP via SBIRs, Universities and Int’l RelationshipsGrow workforce customer focus AP\/SP Mission, Functions & Tasks AP\/SP Mission – Create and Deliver high quality concepts and prototypes for the customerFunctions – Program Management cost, schedule, performance, riskTasks – Understand LOB and AP\/SP PortfolioWork with S&BD and AR to match emerging business opportunities with emerging technologies\/conceptsCreate, Develop, Design, Produce early concepts and prototypesBuild the People that Build the System AP\/SP is your Innovation Engine to Invent the Future AI Game Run Screen by Screen 2. User Configures Scenario Choose AI for Red Force and Blue Force AI Game Run Screen by Screen 5. Video Replay EVERGLADES Current UCF Program Track 1: Computer Science Senior Design Capstone, 2 semester program4 teams; 3 topicsAnalytics TeamGame Design TeamArtificial Intelligence\/Battle Bots Reinforcement Learning (2 teams)Teams are self organized and self directed.  Team leads presented overall vision for work in October 2019.  Final presentations of designs and working code are due March 4, 2020Track 2: FIEA Graduate Student Work1 Team; 12 peopleTeam shall be comprised of game design focused students at graduate levelProject manager, producers, programmers and graphics design2) Program shall run for 1 semester ~ 12 weeks of work; 4 sprints3) Program shall utilize work from CS Capstone course and follow outlined product requirements Current Status of Game Phase 2 Game Characteristics 2019:  API Change: added a referee port with the purpose of start\/rest of game.Reinforcement Learning Based AI Open Source Tools  Enhanced Story Capture (videos and graphs) Tournament Interface: Development of a tournament bracket logic to allow multiple AIs to compete Server Settings\/Randomness in combat: Accessible via referee API Server Updates: The server has been updated with the following capabilities: Allow games to be played back to backDocker Container Linux build -current platform shall migrate to Linux compatibleOpen AI Wrapper: Python API and Open AI Gym Interface to allow players to communicate with the game serverGame Server Image Renderer: Open GL renderer for RLData DeliveryLinux compatibility Roadmap 2020 (High Level) 1) Enhance node network2) Introduce compelling rewards scale3) Enhance Graphics and Environment Selection(sea, air, land, submarine, space environments)4) Introduce enhanced weaponry capable of illustrative lethality aka spectacular death5) Drone Swarm Capability6) Sub-Agent Hierarchy 3 levels deep Integration of Game Roadmap and UCF\u000bGoal: Continue Battle Rhythm To Enhance, Iterate and Improve Fall 2020: MFC and UCF will continue CS Senior Design class focused on topics 1-31) Enhance node network2) Introduce compelling rewards scale3) Enhance Graphics and Environment Selection (sea, air, land, submarine, space environments)Fall 2020 FIEA UCF Graduate Course (pending Game Lab course offering) 4) Introduce enhanced weaponry capable of illustrative     lethality aka spectacular death5) Drone Swarm Capability6) Sub-Agent Hierarchy 3 levels deep",
        "7": "Improving Java Verification with OpenJML Gary T. Leavens, Leavens@ucf.eduhttp:\/\/www.cs.ucf.edu\/~leavens\/ August 31, 2020 Problem Software is everywhereSafety-critical systems (cars, busses, …)Mission-critical systems (spacecraft, …)Business-critical systems (banking, …)Science (climate models, …)Healthcare (medical devices, …) Photo by Timur M on Unsplash Problem Software has bugsBugs can lead to failuresDeathInjuryMonetary lossLoss of trust\/reputationSecurity breaches Photo by Daniela Santos on Unsplash Current Approaches Coding StandardsCode ReviewsTesting Photo by Christina @ wocintechchat.com on Unsplash Limits of Testing “Program testing can best \u000bshow the presence of errors \u000bbut never their absence.” Photo of Edsger Dijkstra from wiki.c2.com\/ Part of a Solution: Formal Verification Verification steps:Specify program with logicConvert program into logical statementProve that the program is correct From “An Axiomatic Basis \u000bfor Computer Programming” by C.A.R. HoareCACM, 12(10):576-583, Oct. 1969 JML: Tools for Java Formal Methods JML Annotated Java public class Color {    public static final int SATURATED = 256;    \/*@ spec_public @*\/ private int red, green, blue;    \/\/@ public invariant 0 <= red && red < SATURATED;    \/\/@ public invariant 0 <= green && green < SATURATED;    \/\/@ public invariant 0 <= blue && blue < SATURATED;    \/*@ requires 0 <= red + amount;      @ assignable red;      @ ensures red == \\old(red + amount);      @*\/    public void adjustRed(int amount) { red += amount; }    \/\/@ ensures \\result == red;    public \/*@ pure @*\/ int getRed() { return red; }    \/\/ ...} www.jmlspecs.org OpenJML (ESC) jmldoc KeY, LOOP Daikon ajmlc Runtime checkedclass file Correctness proof Color.java:12: warning: The prover cannot establish an assertion (InvariantExit: Color.java:4: ) in method adjustRed    public void adjustRed(int amount) { red += amount; }                ^Color.java:4: warning: Associated declaration: Color.java:12:     \/\/@ public invariant 0 <= red && red < SATURATED;               ^Color.java:12: warning: The prover cannot establish an assertion (ArithmeticOperationRange) in method adjustRed:  overflow in int sum    public void adjustRed(int amount) { red += amount; }                                            ^ Data trace file \u000bfrom instrumented version of code OpenJML Tool Extends OpenJDKHosted on github.comSources:~ 11k files (+ 4k for OpenJDK)~ 2k directories (+ 1k for OpenJDK) What Needs Work? Overall: verify programs that use StringsDetails:Connect with newer SMT solver versionsZ3CVC4Experiment with String program verificationCheck that:Correct programs verifyIncorrect programs give appropriate warnings Possible Extensions Extensions:Floating-point verification: float, doublePrograms that use the JDKBetter JDK specificationsJava AnnotationsIntegration with JMLWorking with nonnull and other 3rd party annotations Helpful background COP 3402 (Systems Software)COP 4020 (Programming Languages)COT 4210 (Discrete Math)Logic coursesCOP 5021 (Program Analysis) Summary Fix OpenJML to verify programs using StringsConnect to newer SMT solversExperiment with verification of String programsModify the OpenJML tool",
        "8": "Florida Space Institute\u000bComputer Science Senior Design Project 2020 Simulation Exploration Experience (SEE 2021) Autonomous Lunar Construction SEE 2021 Goals Simulate a Lunar Base, Self Sufficient, ExpandingEnhance 2020 Rovers, Fuel Production, Maintenance and OpsAdd Terrain, including Terrain impacts in Rover modelsIntegrate with and Support SEE 2021 (April)International Student  teams: US, Canada, Brazil, UK, Germany, France, Italy & BulgariaEvent will be in Brazil and VirtualProvide Distributed Simulation CapabilityIndustry Standard Distributed Computing Tools and ProductsSystem Infrastructure, Cloud Servers, VPNCollaboration and Knowledge Management Services 2 SEE UCF CS 2021 Goals Build a Lunar Launch and Landing Site (Space Port)Autonomously, With different classes of robots, With International PartnersWith NASA Mentor and Space Institute SupportProvide the AI Governance for a RE-RASSOR Robotic SwarmThat builds a protective berm to deflect or capture plume ejectaThat builds and landing pad from provided interlocking blocks.That keeps all the Robots safe (power management, lunar night, charging)Note: UCF developed ROS simulations exist for EZ-RASSOR robot behavior and controlIntegrate with and Support SEE 2021Teach others (International Teams) how to interact with your RobotsProvide 3 RTI Servers for development teams (Cloud, Windows, Linux)Event will be in Brazil and Virtual 3 RASSOR Robots 4 Previous Lunar SEE Events in DON SEE Project Requirements Some Languages C, C++, JAVA, PythonHLA-evolved, High Level Architecture (used in NASA space exploration) Tools and Skills on TeamGame Development desired working with Unity 5Some 3D modeling experienceBasic System Operations Experience Desired  Parse, Read and Write XML DataUS CitizenshipFor the NASA Integration (COVID will govern site visits) 6 SEE Process Develop and Deploy Simulation InfrastructureIEE 1516, HLA Evolved, with MAK and PitchDON 3.1 (Distributed Observer Network) NASA Game Based Visualizer for Complex Information and MPC XML InterfaceDevelop Virtual Space mission, with SEE Teams, for April 2021With NASA Subject Matter Experts and Concepts \/ ModelsBuild on NASA Concepts for a Mars BaseIntegrate with Simulation Infrastructure and Lunar Base elementsPresent Results to NASA Exploration CommunitySimulation will help inform Mars Planning and NASA StudiesIf Possible, present outside NASA as well Why SEE? Industry Tools, Distributed Computing, Distributed VisualizationUse NASA tools and technologies to build a working Mars BaseInter-university international TeamworkProfessional network, credibility, visibility\u000bCreate something—a simulation system-- that will be enhanced and evolved by othersAdd sophistication, value and capability to the simulation to solve space exploration problems",
        "9": "   UCF Marine Turtle research group Photos: UCF MTRG, K. Mansfield, J. Abernethy 37+ years of nesting beach research37+ years of coastal juvenile research11+ years of oceanic juvenile research Whole – life history approach:    UCF Marine Turtle research group Four main projectsBeach monitoringIn water coastal nettingOffshore captureNesting surveys – just nest\/crawl countsStandardized data collection since 1982Tags for individual identificationMorphometricsMetadataDaily number of nests laid Photos: G. Stahelin, R. Chabot, UCF MTRG    Nighttime surveys Photos: C. Long, R. Chabot, K. Mills, G. Stahelin, K. Phillips    Daytime surveys Photos: K. Mansfield, G. Stahelin, E. Seney    Nest inventories Photos: MTRG AtlanticOcean Sebastian Inlet Trident Basin    COASTAL SAMPLING (Juveniles) AtlanticOcean Photos: K. Mansfield; G. Stahelin    Offshore sampling    DATA USE Scientific Advisory ServicePost-construction\/nourishment monitoringProvide data to state and federal agencies (20-33% of all Atlantic sea turtle nesting happens in our study area)Post-oil-spill assessmentsRobust analyses for conservation\/species recoveryPartnerships or contracts with: ACOE, USFWS, NOAA, NMFS, FWCC, Brevard County, etc.Research and EducationPlatform for undergraduate and graduate researchField-based training\/pre-veterinary experienceOutreach    CURRENT DATABASE—Problem Photos: UCF MTRG, K. Mansfield Current database is old, not relationalUnable to query and generate reportsNeed to enter data chronologicallyDatabase grew with project over decades but didn’t grow with available database techKey data reported in comments (older entries)Limited\/clunky remote access from field station    NEW DATABASE - in development Previous students developed a new database from scratch – Hosted in AWSGOAL:Work on what previous students did, fix issues, and implement new features.    problems Check for multiple tags at once to determine capture type Tag #1 Tag #2 Tag #3 NEW NEW NEW MTRG MTRG MTRG AUTOMATICALLY CHECK BOX:NEW ENCOUNTER Tag #1 Tag #2 Tag #3 OLD NEW OLD MTRG MTRG OTHER AUTOMATICALLY CHECK BOXES:RECAPTURESTRANGE ENCOUNTER NEW or OLD? “OWNER”    problems Export interface    Requirements Must-have:Access to database from a web browser with full capabilitiesDevelop phone browser interfaceAbility to add\/remove or rearrange fields or layout as neededProgramming language that does not require annual renewals of licenses or that limit the number of computers\/browsers allowed to access itAbility to track individual turtles through time with changes to tags (tag loss\/new tags)Ability to generate customizable reports for agency deliverablesFeature with individual turtles to track fate of samples collected from those turtles\/time (where stored, if used, results from analyses like stable isotope, genetics, diet, etc.).    Requirements Nice-to-have:GIS featuresAbility to track data (nest numbers, nest success) through time by area surveyed (half-km standardized survey areas) *partially implementedHome run:All of the above, plus…Capacity to store scanned documents and photos (or link records to a specific document stored in the cloud) *Already implemented, but can improve",
        "10": "2+ Community A Tool for Community Driven Placemaking  Public Places Gone Bad! The “placemaking” process in cities and communities is broken. Community leaders and members wanting pedestrian friendly, crowd gathering cultural hubs in their communities, are left with developer driven projects that tear at the identity of their towns.  What makes a Place Great? Pipeline to better Placemaking PART 1 PART 2 t Part 1: Measuring Place                    Collecting Public Behavior and public opinion Data:The goal for this portion of the project is to be able to measure the existing conditions of a public place against known other successful places. Creating an algorithm of measured qualities will impower local officials in striving to make better places for their communities. The outputs will specify areas to be worked on for the biggest impact to their public places.  t Part 1: Measuring Place Create: mobile application for android or apple using same backend tech as 2+ Community: Part 2Develop new and recreate tests measuring public lifeStationary Activity Mapping (example)People moving Counts (example)Solar Shade study Building program study….. and so on (see  image below)Record observed and gathered data:ChartsAdd points, lines, and data to google maps on site. Analyze Data:Layer maps of test results on and off Create charts and graphs using data collectedCreating an algorithm: use the findings to rank the measured space relative to other “places”.  Create: survey collecting Public Voice and opinionQualtrics with touchable graphic interface Bonus: Be able to record voice to text for opinion question.  Pipeline to better Placemaking PART 1 PART 2 Part 1: Measuring Place Part 2: Digital Engagement of Place Part 2: Digital Engagement of Place Collecting Public reaction to on site AR designs options: Designs provided by UCF Architecture.  The goal for this portion of the project is to be able to create an interactive experience exposing residents to potential local projects. Gathering local’s opinion creates direction and buy-in to the futures of there places. With the same backend technology as Part 1, We must be able to place digital content in a hyper geolocation. (amongst other buildings and objects) These designs will need to be viewed by phone, tablet, or headset. Surveyed opinions will be collected on the 2 or more design options. Upon finishing, participants can get a dynamic view of where their opinion is in relationship to others.  Part 2: Digital Engagement of Place Create: mobile application for android or apple using same backend tech as 2+ Community: Part 1Develop a viewer using onsite augment reality to view potential physical projects in an urban fabric.Located: Models must be lockable to a hyper geolocation. (i.e. building lot in the middle of downtown) using gps and\/or markers.Viewable: Models must be viewable vertically up to 400’ and stable enough to walk around from the outsideBonus: be able to walk insideClickable: Hot points on models will lead to pre rendered images and videos with additional information. Design Options: Views: Users will be able to switch between design options. Gather: Users will be presented with voting and comment opportunities.Analise: Upon finishing, participants can get a dynamic view of where their opinion is in relationship to others.   Bonus: if a set of virtual blocks could be arranged by viewer and left for the next person to see and interact with.  QUALTY PLACEMAKING",
        "11": "Florida Space Institute \/ CLASS\u000bComputer Science Senior Design Project Fall 2020 Plume Ejecta Lunar Tools – PELT IIEZ-RASSOR \/ RE-RASSOR PELT II – Plume Ejecta Lunar Tools Two 2 Why PELT? A large propulsive lander, the only kind for the moon, will kick up a LOT of stuff. Think Starship.There will be a hole in the groundThe debris will go someplace as some speedSomeplace includes kilometers away, and kilometers upSome speed is many kilometers per secondThere is stuff on the ground to hitIt can be raining dust all over the moonThere is stuff in space to hit, that is moving really realy fastLike driving through a rain storm, 200 MPH, no windshield, but worseMuch WorseWe need to Know what is happening and Share what is happening! 3 Pre PELT I 4 Moon Local: Moon Area: GatewayStation Orbit PELT I 5 PELT II There are still a few needs:Particle Collision Detection and Analysis, including particle to particle and particle to surface interactions.  Can we hide behind something?Erosion Rates on landing sites.  How big is the hole?Dynamic Landings and Environmental inputs.  What does the entire landing look like?File, Archive and Runtime Optimization for the 2D system.  How do we save it?3D User Interface and integration with Shaders & Displays.  How do we communicate?The Goal is to:Dramatically increase the ability to quickly and reliably analyze Lunar launch and landing impacts across the Cislunar environment.  Create a product the PI, Dr. Phil Metzger can Give to NASA, as opposed to using for themhttps:\/\/www.youtube.com\/watch?v=AuP6kWyDO_Q&feature=youtu.be 6 Questions? 7",
        "12": "CodeFeel Practical Programming Tutoring and Grading System Dr. John MurrayAssistant ProfessorUniversity of Central FloridaGames and Interactive Media DepartmentNicholson School of Communication and Media My Background Researching user experience and content authoring in AR\/VR\/XRTeach intro to programming at graduate and undergraduate levels Summary Instructor-friendly programming behavior analysis and intervention toolBuilds on existing Intelligent Tutoring Research & System designIncorporates test-based assessment approaches for both self-assessment, feedback and automated grading of certain assignments Technologies:TypeScript\/JavaScriptMongoDBVSCode ExtensionsWebsocketsCanvasRESTful API NodeJSUnity3DPythonC#GitDocker Current State Server with MongoDB\/Node architecture that handles GitHub webhooks and logs events (compiler errors, session details)Bash script that handles registering student git repositories with server\/databaseUnity plugin that monitors for errors and which sends test results to serverVS Code extension that saves and commits each change to git repository, and which updates each component (bash, vs-code extension, unity plugin)Submission for unity projects includes building project using virtual machine and running tests through existing test frameworkResults are posted to webcourses using manual rubric alignment Project Goals Provide instructor-friendly web interface for managing:Programming Assignments (git repos, updates & submissions)Student activity logsError and activity analysis (event notifications)Test casesProvide students with in-editor advice based on activities:Suggest videos from a set of videos on topics based on errors observedTrack progress over time (typing speed, error rate, etc)Built on a custom VS Code extension that communicates with server Minimum Requirements Teacher\/TA Interface:Create assignments (Git Repositories linked to problem\/test models)Support two of three languages\/frameworks through INDEPENDENT modules and support:C# \/ Unity (Unity TestFramework)PythonReact (JavaScript)Student Experience:View tutorial\/tests in a WebView in VS Code or in a panel in Unity.Provide details on activity\/errors\/current test results independent of technology in interface (VSCode) Reach VS Code extension for instructors managing students (access to their repository, group and individual analysis, comments to be posted to WebCourses)Notifications to instructor and\/or student based on certain patterns of errors\/activity (or lack thereof). Customizable in web interface Home Run Connect project fully into webcourses for instructors at UCF to use in their classes, with a GUI for selecting assignments and configuring Rubrics for 1-3 of the technologies (React, Unity, Python)Automated tests to ensure reliability Questions? Contact Info:jtm@ucf.eduFeel free to email me to discuss via Zoom or Skype",
        "13": "CECS Senior Design Project Assignment Process Faculty Team Assignments (CS, IEMS & MAE) Student Self Selection (ECE)",
        "14": "CS Design Project:\u000b\u000bPersistent Cyber Training Environment Testing\u000b\u000bBruce Caulkins\u000bGlenn Martin\u000bAmit Kapadia Agenda PCTEPCTE TestingKREWhat’s RequiredBonusQuestions 2 Persistent Cyber Training Environment 3 PCTE Description 4 PCTE Details 5 PCTE Testing  6 API testsContract testsLoad\/Scaling testsAutomated testing PCTE Automated Testing  7 API testsContract testsLoad\/Scaling testsAutomated testing CI\/CD Pipeline Continuous IntegrationContinuous DeliveryOur focus is on testingParticularly within the CI pipelineBut also within CD pipelineSoftware bugsIntegration BugsImage Credit: Katalon 8 Katalon Studio & Runtime Engine Used by UCF testers to support development of automated testing tools on PCTE platformRuntime Engine executed within an Ubuntu-based Docker containerSchedules tests using OS servicesCreates batch operations for control multiple executionsExecutes tests with distributed servers 9 What’s Required Two teams, Black vs GoldKRE works but has a few issues in our domain… so… What if we wrote a new runtime engine?Goal is to create a program that is a new runtime engine that leverages a lot of what Katalon has in placeUse tests developed in Katalon StudioTests are stored as Groovy scripts that call a WebDriver to perform actionsChrome used the mostGrouped as Test Suites (XML files)Leverage Execution Profiles (also XML files)Essentially a set of global parametersProgram would leverage Katalon APIs  10 Bonus That gets exposure to CI\/CD pipelines and automated testing paradigmsBonus Extension Ideas:Tie into a known, existing CI\/CD pipelineJenkins, perhapsSupport other WebDriversFirefoxEdgeShow running within a headless environment (Xvfb in Linux)Integrate new runtime engine into Katalon Studio GUI 11 Closing Slide Questions?bcaulkin@ist.ucf.edumartin@ist.ucf.edu",
        "15": "Florida Space Institute \/ CLASS\u000bComputer Science Senior Design Project Fall 2020 Plume Ejecta Lunar Tools – PELT IIEZ-RASSOR \/ RE-RASSOR PELT II – Plume Ejecta Lunar Tools Two 2 Why PELT? A large propulsive lander, the only kind for the moon, will kick up a LOT of stuff. Think Starship.There will be a hole in the groundThe debris will go someplace as some speedSomeplace includes kilometers away, and kilometers upSome speed is many kilometers per secondThere is stuff on the ground to hitIt can be raining dust all over the moonThere is stuff in space to hit, that is moving really realy fastLike driving through a rain storm, 200 MPH, no windshield, but worseMuch WorseWe need to Know what is happening and Share what is happening! 3 Pre PELT I 4 Moon Local: Moon Area: GatewayStation Orbit PELT I 5 PELT II There are still a few needs:Particle Collision Detection and Analysis, including particle to particle and particle to surface interactions.  Can we hide behind something?Erosion Rates on landing sites.  How big is the hole?Dynamic Landings and Environmental inputs.  What does the entire landing look like?File, Archive and Runtime Optimization for the 2D system.  How do we save it?3D User Interface and integration with Shaders & Displays.  How do we communicate?The Goal is to:Dramatically increase the ability to quickly and reliably analyze Lunar launch and landing impacts across the Cislunar environment.  Create a product the PI, Dr. Phil Metzger can Give to NASA, as opposed to using for themhttps:\/\/www.youtube.com\/watch?v=AuP6kWyDO_Q&feature=youtu.be 6 Questions? 7",
        "16": "EZ-RASSOR \/ RE-RASSOR Research and EducationRegolith Advanced Surface Systems Operational Robot 1 Why RE-RASSOR Robots are not easyMost Robotic Projects need a mobility platform as well as mission elementsThe mobility platforms consume a significant portion of project resources leaving little for mission elementsThe ChallengeDevelop inexpensive and extensible mobility platforms that will satisfy the needs associated with Research and STEM \/ STEAM Education.  RE-RASSOR combines NASA Kennedy SwampWorks licensed designs with UCF Student developed EZ-RASSOR software to meet these needs. The GoalA common hardware and software (control and AI) system for use across ALL FSI Robotics projects and available to anyone who needs it.Open Source Hardware and SoftwareA collection of robots teams can check out and then focus on MISSION ELEMENTS 2 The First Years 3 This Year Commodity Computing HardwareComputer and Robot parts from Amazon (both control and AI)Available to any user, Mega and Nvidia Nano boards, stepper motor interfaceEZ-RASSOR SoftwareBuild Control software into Mega with wifiBuild AI into Nano, let it driveDrive and execute missions with Human or AI controlMake it all work TogetherIn Simulator, In Person, on Multiple RobotsCoaching other projects as needed, like FL Poly ¼ ton rover.Florida Space Grant will fund this project 4 So… Integrate UCF Developed, Open Source SoftwareAdd Software to make it all work in a Live environment (not trivial)Build a little robot to test it, then make it work againPut an AI on the robot so it can find its way around (auto nav)Teach others how to do it on a 500 pound robot (built at FL Poly)Join the EZ-RASSOR team, Add your code to the mixBe a NASA SSERVI CollaboratorAnd, be thanked by every future project that does not have to code and build a robot from scratch, forever. 5 Questions? 6",
        "17": "",
        "18": "QuotationsfromJohnson™sDictionaryAmyLarnerGiroux,PhDConnieHarperUCFCenterforHumanities&DigitalResearch7 8QuotationResearchJohnson used quotes to show examples of usage of the wordsWhenthetextwouldn™tfitwithintheareanecessaryintheprinteddictionary, he would paraphrase the quoteSometimeshewouldmisidentifythequote or not use the right attribution 9TheData 101.IdentifyappropriateonlinecorporalikeGutenbergwhereworksbytheauthorwouldbeavailablelikeEarlyEnglishBooksOnline),ProjectGutenberg,LibertyFund,Archive.org,HathiTrust2.Determinewhetheryoucanprogrammaticallyquerythosetextsonlineorwhetheryou™llneedtohaveadownloadprocess3.Createanalgorithmwithsometypeoffuzzysearchortextreusetolocatepossiblematches.Scoreyourmatchesandoutputthetop5perword.4.Outputaspreadsheetthathastheinputdataplusthetitleoftheworkyoufounditin,alinktotheLibraryofCongress™slinkedopendatafortheauthor,alinktotheonlinetextinwhichthequotewasfound,thematchscore,andtheactualtextofthequoteyoufound.5.HaveaUIthatallowstheusertoselectaspreadsheet,thecorpustouseforcomparison,andanoutputdirectoryfortheresults.Requirements 11ExampleOutput 121.AsecondUIthatallowsausertostepthroughtherowsfromtheoutputspreadsheetandhaveitdisplaytheoriginaldictionaryquoteandthenthescoredquotesthatwerefoundandthenallowtheusertopickwhichofthe5isthebestmatchandflagthatsomewayintheexcelfile.StretchGoals 13Questions?AmyG@ucf.eduConnie.Harper@ucf.edu",
        "19": "  COP 4934 Initial Project Proposal\/Requirements Document  Divide and Conquer    Create one document that has a total page count limited to 15 pages and contains the following content: 1. Project descriptive title, group members, and identification of sponsor (if any) or other significant contributors. 2. Project narrative description with a statement of motivation for the project (including at least one paragraph minimum per team member that describes their personal interest\/motivation in this project), a discussion of the goals and objectives, and a discussion of the function of the project.  Be sure to state any design criteria and constraints.  Also you MUST include a separately labeled section or subsection with the title ﬁBroader Impactsﬂ that describes in a minimum of 1 paragraph, the broader implications or impact of your project on society both local and global. How might your project impact underrepresented groups (within science and technology (STEM) or society as a whole), the disabled, non-profit organizations, the environment, diversity, increased participation in STEM fields or the workforce, public engagement in STEM areas, improved national security, enhanced infrastructure, or improved education are all examples. These sections are usually qualitative and avoid using ﬁnumbersﬂ, but contain a conceptual discussion specific to the project.  Use descriptions such as ﬁlightweight, portable, programmable, low cost, flexible, high resolution, scalable, low power, accurate, mobile, peer-to-peer, autonomicﬂ etc. Also you MUST include a separately labeled section or subsection with the title ﬁLegal, Ethical, and Privacy Issuesﬂ that describes in a minimum of 1 paragraph, any such issues that you dealt with as part of the design and implementation of your solution to the original problem and\/or that those using, maintaining, or expanding upon your solution may face going forward. 3. A list of specifications and requirements for the project as a whole as agreed to by both your team members and your project sponsor.  Use as many quantitative measures and metrics as possible.  Think about what metrics you will use to verify and evaluate your project.  Answer the questions: how many, how often, how high, how long, how complex, what values, what events occur, etc.  This section has ﬁnumbersﬂ. It is this section that describes in detail what it means for your project to ﬁworkﬂ. 4. A short description or listing of ﬁideasﬂ from each group member about directions to explore or potential solutions to various aspects of your project. This stems from Dr. Hoekstra™s brainstorming discussion at the Sr. Design Boot Camp. 5. One or more project block diagrams and\/or figures in as much detail as possible (see below).  Include a project high-level diagram that illustrates each component and their connections\/interfaces if appropriate.  Sometimes a drawing will communicate more information about a specific implementation than just words. This is why patents use drawings as well as text as part of the legal description. 6. Project budget and financing. Remember to think about potential software licensing costs, charges from cloud-based services (e.g. AWS), mobile app development, code repositories, 2D\/3D assets, or website graphic design costs. 7. Project milestones (WITH DATES) for both semesters as best as can be determined now   2  Your initial project identification documentation should contain a detailed project block diagram.  This may consist of either a single complete block diagram or a series of nested diagrams, each level containing additional detail.  Construct separate block diagrams for project software and project hardware, if applicable.  Software diagrams should clearly indicate where the software is running (mobile, client, server, cloud), how the various pieces communicate, and what information they are communicating.  The information provided for each block in the diagram should include: 1. The name of the Group member administratively responsible for the block. 2. Block name, which should be descriptive of its function. 3. Block status: a. To be acquired Œ meaning the block will be purchased or donated b. Acquired Œ block has been donated or purchased c. Research Œ block design approach is being investigated d. Design Œ block is currently being designed e. Prototype Œ block is currently being prototyped f. Completed Œ block design is a finished prototype 4. Name each input and output associated with each block 5. Diagram Legend.  The legend should expand all acronyms and describe all named entities in the block diagram by giving brief definitions. Include any additional information that would increase the understanding of the block diagram.  The use of identifier grouping and color may be helpful.  Example: Draw all of member 1™s blocks with red rectangles; draw all of member 2™s blocks with blue rectangles, etc.   ",
        "20": "CemetARyAugmentedRealityEnhancementsAmyLarnerGiroux,PhDNationalCemeteryAdministrationUCFCenterforHumanities&DigitalResearch1 2CemetARyŒCurrentiterationCross platform mobile appProvides 2D navigation between sections of veteran cemeteriesAllows switching to 3D AR navigation once user nears the headstoneUses OCR scanning to read headstone text for searchingAllows dynamic scanning in various lighting conditions and anglesHasapreliminaryadministrative website for database manipulation 3TechnologiesDatabaseMySQL Workbench 8.0APIExpress 4.17 and Node.js 12.9BackendHosted on HerokuWebsiteReact 16.9Mobile ApplicationUnity 2019.2Google Vision 4Requirements1.Database:ŁNeedsarobustimportfunctionthatcantakeaspreadsheetofcemeterydataandaddittothedatabase.ŁNeedsawaytoremovesetsofrowsversusasinglerowatatime(e.g.selectacemeteryandremoveallitsrows)ŁNeedsotherfieldsaddedtomakeitcompatiblewithanotherproject2.Thereneedstobedownloadablecemeteryﬁpacks.ﬂAusercouldspecifyacemeteryandtheirappwoulddownloadittotheirphoneandthenallowthemtouseitoffline.3.Appsearchcriteria:ŁScreenneedstoaddbranchofserviceandmiddlename\/initialŁResultsneedanotherbuttonaccesstheVeteransLegacyMemorialŁTheOCRoftheheadstoneneedstobecomemorerobustandsplitthemiddlename\/initialofftoaseparatefieldŁTheOCRoftheheadstoneneedstoworkbetteroncurvedtext4.Thecurrentversiononlyworksoncellphones.ItneedstobecomeresponsivetoworkoniPadsofvarioussizes.5.Needstohavethedatabase\/websitedeliveredasaDockerfilesothatitcanbemovedfromHerokutoaUCFserver StretchGoals51.Createatourmodewherethedatabasehaswalkingtoursdefinedthathaveasetofgravesitestovisitinaspecificorderasdefinedbythepersonwhosetsitup.2.HaveitworkonWindows10tablets Questions?AmyG@ucf.edu6",
        "21": "",
        "22": "The overall classification of this brief is: UNCLASSIFIED\/FOUOSenior Design Pitch Briefers:  MAJ Linda Chung-Commander™s Initiatives GroupMAJ Oscar Gonzalez, Ph.D. Research PsychologistSGM GarricBanfield, CA Proponent Sergeant MajorType of Brief:  InformationDate:  31 August 2020Version:  1 2UNCLASSFIED\/FOUOŁSpecial Warfare Center and SchoolŁResponsible for Army Special Operations Force GenerationŁFort Bragg, NCWho We Are ObjectiveŁData-focused software featuring:ŒCapability to link dataŁUser-determined variable to bind ŁUser-determinedbinding order ŒUser-friendly GUIŒExecute Basic descriptive Statistics ŒProvide clear outputŒAllow to export datasets   Conditions:ŁData file structure: Columns = Variables and Rows = CasesŁExample: pet owners who entered competition across the US.Note that: ŁParticipants can have multiple entries (6 people, 10 entries)ŁParticipants can compete with different pets (i.e. bob)ŁEvents (Cities) repeat over timeŁData includes scores, dates, categories (yes, no) and labels (dog, cat) ŁData varies in purpose\/utility (i.e. prize vs comment)NamePetCityDateScorePrizeCommentjohndogNYC1\/1\/201710yescharmingjohndogDallas2\/2\/201810yesprettyjohndogLA3\/3\/20199nodifficultjohndogNYC4\/4\/202010yesprettyluiscatLA3\/3\/20198nohypermarydogNYC1\/1\/201710yesdocilebobcatLA3\/3\/20198nocharmingbobdogNYC1\/1\/201710yeshealthytomcatNYC4\/4\/20208noaggressivenichole dogDallas2\/2\/201810yescalm Mission: User-Defined Data BindingŁLink data horizontallyusing key variable (e.g. name) JohndogNYC1\/1\/201710yescharmingdogDallas2\/2\/201810yesprettydogLA3\/3\/20199nodifficultdogNYCNamePetCityDateScorePrizeCommentjohndogNYC1\/1\/201710yescharmingjohndogDallas2\/2\/201810yesprettyjohndogLA3\/3\/20199nodifficultjohndogNYC4\/4\/202010yesprettyluiscatLA3\/3\/20198nohypermarydogNYC1\/1\/201710yesdocilebobcatLA3\/3\/20198nocharmingbobdogNYC1\/1\/201710yeshealthytomcatNYC4\/4\/20208noaggressivenichole dogDallas2\/2\/201810yescalmjohn johnjohnjohnluismarybobbobtomnichole Mission: User-Defined Data BindingŁLink data horizontallyby a key variable (e.g. name)ŁLink according to specific sequence (may be chronological series or not)ŁEx: Defined link order = C2C19 = NYC2017 > Dallas2018 > LA2019  ŁNote: NYC2020 excluded by definitionID (Name)City_1Date_1Prize_1City_2Date_2Prize_2City_3Date_3Prize_3johnNYC1\/1\/2017yesDallas2\/2\/2018yesLA3\/3\/2019nomaryNYC1\/2\/2017yesbobNYC1\/3\/2017yesLA3\/3\/2019nonichole Dallas2\/2\/2018yesluisLA3\/3\/2019noNamePetCityDateScorePrizeCommentjohndogNYC1\/1\/201710yescharmingjohndogDallas2\/2\/201810yesprettyjohndogLA3\/3\/20199nodifficultjohndogNYC4\/4\/202010yesprettyluiscatLA3\/3\/20198nohypermarydogNYC1\/1\/201710yesdocilebobcatLA3\/3\/20198nocharmingbobdogNYC1\/1\/201710yeshealthytomcatNYC4\/4\/20208noaggressivenichole dogDallas2\/2\/201810yescalm Mission: User-Defined Data BindingŁBeyond the order of the data, its output \/ format must be clean and leanID (Name)City_1Date_1Prize_1City_2Date_2Prize_2City_3Date_3Prize_3johnNYC1\/1\/2017yesDallas2\/2\/2018yesLA3\/3\/2019nomaryNYC1\/2\/2017yesbobNYC1\/3\/2017yesLA3\/3\/2019nonichole Dallas2\/2\/2018yesluisLA3\/3\/2019noID (Name)Prize_1Prize_2Prize_3johnyesyesnomaryyesbobyesnonichole yesluisnoNote: User may not need to see dates again given these are pre-established in definition: C2C19 = NYC2017 > Dallas2018 > LA2019 ID (Name)NYC-PrizeDallas-PrizeLA-Prizejohnyesyesnomaryyesbobyesnonichole yesluisnoGoodBetter!Note: Repeating variables warrant special considerations if to be distinguished (_1, _2)  If dataset is \"Coast 2 Coast (C2C)\"  = NYC2017 and Dallas2018 and LA2019, then: 1. How many total participants were involved (at least one entry) in C2C?2. How many participated in all 3 cities of C2C?4. How many WON in all 3 cities of C2C?5. How many participated in Dallas, but not NYC?6. How many participants were C2C repeats (from previous C2C)?7. What's the distribution of prizes by city?Mission: User-Defined Data BindingŁBeyond the order of the data and format, analytical capabilities are needed:ID (Name)NYC-PrizeDallas-PrizeLA-Prizejohnyesyesnomaryyesbobyesnonichole yesluisno5101Add preceding dataNYC = 3, Dallas = 2, LA = 0 Mission Requirement: User-Friendly GUINamePetCityDateScorePrizeCommentjohndogNYC1\/1\/201710yescharmingjohndogDallas2\/2\/201810yesprettyjohndogLA3\/3\/20199nodifficultjohndogNYC4\/4\/202010yesprettyluiscatLA3\/3\/20198nohypermarydogNYC1\/1\/201710yesdocilebobcatLA3\/3\/20198nocharmingbobdogNYC1\/1\/201710yeshealthytomcatNYC4\/4\/20208noaggressivenichole dogDallas2\/2\/201810yescalmPoint and clickorDrag and dropMission Requirement: User-Friendly GUI Identify data sequence (pre-established pathways, chronologically or other)Link data by  key variable Generate Business IntelEasily, Quickly & ReliablyMission: RecapPolicyConsiderations WarrantedUser-friendly GUISimple, clean reports +Exportable Dataset 11UNCLASSFIED\/FOUOQuestions?"
    }
}